{"status":"ok","feed":{"url":"https://medium.com/feed/@torokagoston","title":"Stories by Ágoston Török on Medium","link":"https://medium.com/@torokagoston?source=rss-798a10893c3e------2","author":"","description":"Stories by Ágoston Török on Medium","image":"https://cdn-images-1.medium.com/fit/c/150/150/0*x_b6PCWwIbaeL7_O.jpg"},"items":[{"title":"The Power of a Single Week Dedicated to Innovation","pubDate":"2024-12-04 13:28:57","link":"https://blog.promaton.com/the-power-of-a-single-week-dedicated-to-innovation-585c2721de17?source=rss-798a10893c3e------2","guid":"https://medium.com/p/585c2721de17","author":"Ágoston Török","thumbnail":"","description":"\n<h4>How learnings from our growth and hack week helped kick off Inno Week at Straumann Group</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/720/0*iZCrbyLpd6-kCpgc\"><figcaption>Straumann has built a reputation of advancing dentistry through innovation. Image from Straumann.com</figcaption></figure><h3>Transforming Dentistry Through AI and Innovation</h3>\n<p>At Promaton, our vision has always been to revolutionize dentistry by harnessing the power of AI-driven workflows. But our goal isn’t just to release AI products into the field; we aim to make a tangible impact. This journey began in 2020, when we forged a strategic partnership with Straumann Group, a global leader in tooth replacement and orthodontic solutions. This partnership recently achieved a significant milestone: launching a quarterly innovation event across the Group called <strong>Inno Week</strong>.</p>\n<p>In this post I will explain the motivation behind this, the benefits we already see, the challenges we had to overcome and the things we would do differently.</p>\n<h3>Innovation is in our DNA</h3>\n<p>Straumann’s journey began in 1954 as a family business with a strong pioneering spirit, a commitment to science and a desire for innovation and change. The company had grown into a collection of businesses, and amongst them dental implants. Today the Straumann Group hosts numerous brands that extend beyond implantology into various areas of dental innovation.</p>\n<p>Straumann has built a reputation of advancing dentistry through innovation: if today you are facing implant treatment your safest and most reliable choice is unquestionably the Straumann family of implants. Straumann Group continues to define industry standards in dental implant and restorative design, and over the years extended more and more into the digital side of dentistry with sophisticated softwares like <a href=\"https://www.straumann.com/en/dental-professionals/products-and-solutions/cares-digital-solutions/software/codiagnostix.html\">coDiagnostix</a> or services like <a href=\"https://www.straumann.com/en/dental-professionals/products-and-solutions/cares-digital-solutions/services-and-solutions/smile-in-a-box.html\">Smile in a Box</a>.</p>\n<p>However, <strong>as a company grows the way to foster innovation also has to change</strong>. While in a 10-person startup, good ideas are easier picked up and brought into the roadmap, a &gt;11.000 people company works differently: executives have to oversee changes of a much larger scale and be much more careful with taking risky bets. This is why strong corporations have <a href=\"https://www.straumann.com/group/en/home/about/our-business/innovation.html\">established processes</a> to nurture truly novel ideas.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*0vhP8YOKRZvx_XVltxRU3w.png\"><figcaption>Fostering innovation requires a good balance between encouraging risky bets and managing risks</figcaption></figure><p>Straumann already runs a solid <a href=\"https://www.straumann.com/group/en/home/about/our-business/innovation.html\">innovation program</a> to foster ideas that have a chance for a big impact from inception to prototype. At the same time we felt that we could help the very early steps of innovation even more, for two reasons:</p>\n<ul>\n<li>There are innovations that may lack the potential for industry-wide impact but would make people’s (employees or users) work or life easier.</li>\n<li>Giving a little bit of extra room for an early experiment on a product innovation can help the innovators to build a much better defined case for their idea.</li>\n</ul>\n<p>Luckily, such initiatives have already been independently implemented in some sites: Montreal, Chemnitz and in our team too. And since these brought some quite visible success stories (you can read about one that we liked very much <a href=\"https://blog.promaton.com/point-cloud-registration-using-fully-convolutional-geometric-features-fa1c1b2627b7\">here</a>), two brave site leads (Bas Verheij (Promaton) and Claude Sasseville (Montreal)) could make the proposal to introduce this format in the entire digital arm of Straumann Group, which has several hundred employees.</p>\n<p>On top of the above two points, performing such an introduction has the potential to bring in a third benefit too, which is:</p>\n<ul><li>Cross-pollination between teams and departments. Even if you haven’t been working in a big company, you could probably imagine how difficult it could be to get to know people, processes and products outside of your day-to-day connections.</li></ul>\n<p>And this is where my involvement as CTO of Promaton started.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*-AXwJWY01bWcvgo2G0SS4w.png\"><figcaption>Improving early stage innovation has three key benefits</figcaption></figure><h3>You just have to implement it, right?</h3>\n<p>One could think:</p>\n<blockquote>“So you had two implementations already; just take the best of both worlds and kick it off. Bamm! Success!”</blockquote>\n<p>Well, it’s not that easy. First of all an organizing committee was created, consisting of Mathieu Guindon (Straumann Montreal), Julien Marbach (Straumann Montreal) and me, with the task to define how the Inno Week should look. We all had useful learnings from previous implementations:</p>\n<ol>\n<li>We saw that both of our versions attracted lots of very creative ideas. The key was to really let people come up with their own innovations, be that improving a product or a process or even just learning about a cool new idea.</li>\n<li>We also saw that bringing novel ideas to the roadmap required lots of effort. So we wanted to make sure that with the bigger implementation, we had well-defined processes to support that.</li>\n<li>We also saw that engaging people, mentoring, detailed reviews and different prizes (e.g. Best Clinical or Most Visionary) mean that such an Inno Week concept is much more than just a kickoff presentation. We had to think about how to extend the group of organizers and which “features” of the previous implementations we really wanted to keep.</li>\n</ol>\n<p>We also looked at implementations at other companies and learned from their insights too. Some quite interesting formats to support innovation are (or were in the past) the <a href=\"https://www.atlassian.com/company/shipit\">Atlassian ShipIt</a>, <a href=\"https://abc.xyz/investor/founders-letters/ipo-letter/\">Google’s 20% rule</a> and <a href=\"https://www.wired.com/1998/01/the-15-percent-solution/\">3M 15%</a> solution.</p>\n<p>After some iterations involving Bas and Claude too, we arrived at a presentation that, on one slide, explained the concept (i.e. who, when, why, what) and were ready to start pitching it to all relevant stakeholders. Even though we had the top management’s buy-in, we still had to make sure that everyone understood the benefits of doing the Inno Week, since the cost (i.e. 1 week is diverted from the <a href=\"https://scaledagileframework.com/\">program increment</a> delivery) was clear.</p>\n<p>Our pitch was the following:</p>\n<ul>\n<li>\n<strong>Goal</strong>: testing, proving &amp; pitching new ideas with rapid prototypes, cross-pollination of knowledge &amp; skills, make sure we are at the forefront of digital innovation!</li>\n<li>\n<strong>Participation</strong>: anyone in the organization can participate, but please make sure you have managerial approval before the Inno Week.</li>\n<li>\n<strong>Topics</strong>: Inno Week topics can be either rapid prototyping, process improvement, or research on a hypothesis. Projects can be performed in a team or individually.</li>\n<li>\n<strong>Results</strong>: each team or individual participating in the Inno Week should end with a demo (preferred), presentation (max 10 slide) or a video (max 3 min) of their results, this should be submitted to be considered for evaluation &amp; rewards.</li>\n<li>\n<strong>Governance</strong>: Inno Week is governed by the Innovation Committee and executed with the help of ambassadors who support participants &amp; champion innovation culture in the different locations.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GkXM6gYSntU6k1siBOrAnw.png\"><figcaption>The 5 keys to a successful Inno Week</figcaption></figure><p>This way, we clarified that the goal is not only direct innovation but also indirectly facilitating innovation by building bridges between teams that otherwise wouldn’t work together. On the participation side, we made sure that managers are an active part of the journey by giving them an overview of who is participating from their teams and the option to keep critical things in progress if needed. We made sure that it’s clear that while there are little limitations on the topics we have clear expectations on the outcome formats. This way people focus on reaching a presentable state by the end of the week. Finally, we started mapping the people who are committed to innovation in the different teams and onboarded them as ambassadors or asked them to join as organizers (this is how the great Albrecht Schnappauf joined us with his 30+ years in tangible innovation).</p>\n<h3>The first run of the new concept</h3>\n<p>The first iteration of the Inno Week was scheduled for the final week of the Q1 2024 program increment, just before the planning of the next quarter. We advertised it in the Software and Tech All Hands meeting, we connected with the overall Straumann innovation initiatives, we made sure that all questions were promptly answered and then we embraced for Monday, 18 Mar 2024, when the first run commenced. I was nervous that week because the stakes were high; we asked for one week from everyone, in return for bringing bottom-up innovations to processes and products.</p>\n<p>Luckily, we had quite promising signals: people submitted more than 80 ideas, and more than 250 colleagues checked them out, engaging in different ways: likes, upvotes and comments. This meant we had quite a good chance of booking some success already in the first iteration because one thing we were sure of: we were going to learn a lot about what we would have to change in the next iteration. Probably the most important highlights are the following:</p>\n<ul>\n<li>We managed to involve <strong>almost all of the sites</strong> in the first iteration! Due to the timing (doing the Inno Week just before the planning of the next quarter) some teams opted for finishing their quarters rather than trying out this new format.</li>\n<li>We had some quite visible <strong>collaboration between sites,</strong> providing clear evidence of effective cross-pollination. I myself was even collaborating with a team I didn’t know beforehand, this helped me a lot in understanding better what kind of different experts are working in other sites.</li>\n<li>We had a few <strong>extremely promising projects</strong> that fitted perfectly the Group-wide innovation program, so we started preparing them together with the teams for a submission.</li>\n</ul>\n<p>There were also some lowlights that we had to think about:</p>\n<ul>\n<li>The <strong>timing</strong> of the first Inno Week was not ideal. Before the PI planning, everybody is still in the crazy last push to meet the goals. In this context, the Inno Week could come across as a distraction, so we had to work with the software portfolio management team to get a better timing for the next iterations.</li>\n<li>Our <strong>onboarding of the ambassadors</strong> was not perfect. Some of them said they weren’t sure about what they should do, and a few of them admitted that they didn’t get the concept clear either. While we did our best, we learned that you should never underestimate the difficulty of communicating something in a simple narrative so everyone understands it.</li>\n<li>Our communication about the aim and definition of the Inno Week was not clear enough in some areas of the <a href=\"https://erinmeyer.com/books/the-culture-map/\">culture map</a>. Some cultures would participate to win prizes, some simply to try out new things, for others the idea of bottom-up innovation does not come naturally. This means, again, that we had to be very clear with our communication and, for some sites, do additional onboarding sessions.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*NAEjCwrbBiaG1RiO18cj-A.png\"><figcaption>Reflection on the first Inno Week</figcaption></figure><p>Three highlights and three lowlights, so was it a success? We were introducing a new concept, so the most important KPI for us was to have enough traction/success for this first iteration to make a second iteration possible. And that was clearly there. As a matter of fact, I’m writing this during the third iteration when I chose this blog post as my project.</p>\n<h3>An environment that fosters innovation</h3>\n<p>Now, almost one year after we started working on the implementation of the Inno Week, we see it as a stable part of our culture. There are some solid successes fueling it; both with building bridges between teams and with product enhancements already being rolled out to users of our digital portfolio. We also see many smaller daily reminders of the benefits of bottom-up innovation, like an easier request form, a more stable CI, or an updated tooling. We are still not at the point where everyone is participating in the Inno Week, but ultimately, it’s not the goal either. The aim is to provide a format that allows ideas to be tested quickly and learn from people you would otherwise not necessarily meet. These small things make big companies enjoy some of the most important benefits of smaller startups, while also having the resources and maturity to make a stable global impact.</p>\n<p>On a more personal side, I’m proud that this crucial component of Promaton’s culture is flowing into the culture of Straumann Group. It’s a good thing and it fueled so many of our innovations, so it is amazing to see it working now on a much bigger scale too. Obviously, this couldn’t be done without the support of key members of the Executive Management Board of Straumann (Thomas Friese and Florian Kirsch) and without the hard work and dedication of Mathieu, Julien, Claude and Bas (see above).</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=585c2721de17\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://blog.promaton.com/the-power-of-a-single-week-dedicated-to-innovation-585c2721de17\">The Power of a Single Week Dedicated to Innovation</a> was originally published in <a href=\"https://blog.promaton.com/\">Promaton</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h4>How learnings from our growth and hack week helped kick off Inno Week at Straumann Group</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/720/0*iZCrbyLpd6-kCpgc\"><figcaption>Straumann has built a reputation of advancing dentistry through innovation. Image from Straumann.com</figcaption></figure><h3>Transforming Dentistry Through AI and Innovation</h3>\n<p>At Promaton, our vision has always been to revolutionize dentistry by harnessing the power of AI-driven workflows. But our goal isn’t just to release AI products into the field; we aim to make a tangible impact. This journey began in 2020, when we forged a strategic partnership with Straumann Group, a global leader in tooth replacement and orthodontic solutions. This partnership recently achieved a significant milestone: launching a quarterly innovation event across the Group called <strong>Inno Week</strong>.</p>\n<p>In this post I will explain the motivation behind this, the benefits we already see, the challenges we had to overcome and the things we would do differently.</p>\n<h3>Innovation is in our DNA</h3>\n<p>Straumann’s journey began in 1954 as a family business with a strong pioneering spirit, a commitment to science and a desire for innovation and change. The company had grown into a collection of businesses, and amongst them dental implants. Today the Straumann Group hosts numerous brands that extend beyond implantology into various areas of dental innovation.</p>\n<p>Straumann has built a reputation of advancing dentistry through innovation: if today you are facing implant treatment your safest and most reliable choice is unquestionably the Straumann family of implants. Straumann Group continues to define industry standards in dental implant and restorative design, and over the years extended more and more into the digital side of dentistry with sophisticated softwares like <a href=\"https://www.straumann.com/en/dental-professionals/products-and-solutions/cares-digital-solutions/software/codiagnostix.html\">coDiagnostix</a> or services like <a href=\"https://www.straumann.com/en/dental-professionals/products-and-solutions/cares-digital-solutions/services-and-solutions/smile-in-a-box.html\">Smile in a Box</a>.</p>\n<p>However, <strong>as a company grows the way to foster innovation also has to change</strong>. While in a 10-person startup, good ideas are easier picked up and brought into the roadmap, a &gt;11.000 people company works differently: executives have to oversee changes of a much larger scale and be much more careful with taking risky bets. This is why strong corporations have <a href=\"https://www.straumann.com/group/en/home/about/our-business/innovation.html\">established processes</a> to nurture truly novel ideas.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*0vhP8YOKRZvx_XVltxRU3w.png\"><figcaption>Fostering innovation requires a good balance between encouraging risky bets and managing risks</figcaption></figure><p>Straumann already runs a solid <a href=\"https://www.straumann.com/group/en/home/about/our-business/innovation.html\">innovation program</a> to foster ideas that have a chance for a big impact from inception to prototype. At the same time we felt that we could help the very early steps of innovation even more, for two reasons:</p>\n<ul>\n<li>There are innovations that may lack the potential for industry-wide impact but would make people’s (employees or users) work or life easier.</li>\n<li>Giving a little bit of extra room for an early experiment on a product innovation can help the innovators to build a much better defined case for their idea.</li>\n</ul>\n<p>Luckily, such initiatives have already been independently implemented in some sites: Montreal, Chemnitz and in our team too. And since these brought some quite visible success stories (you can read about one that we liked very much <a href=\"https://blog.promaton.com/point-cloud-registration-using-fully-convolutional-geometric-features-fa1c1b2627b7\">here</a>), two brave site leads (Bas Verheij (Promaton) and Claude Sasseville (Montreal)) could make the proposal to introduce this format in the entire digital arm of Straumann Group, which has several hundred employees.</p>\n<p>On top of the above two points, performing such an introduction has the potential to bring in a third benefit too, which is:</p>\n<ul><li>Cross-pollination between teams and departments. Even if you haven’t been working in a big company, you could probably imagine how difficult it could be to get to know people, processes and products outside of your day-to-day connections.</li></ul>\n<p>And this is where my involvement as CTO of Promaton started.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*-AXwJWY01bWcvgo2G0SS4w.png\"><figcaption>Improving early stage innovation has three key benefits</figcaption></figure><h3>You just have to implement it, right?</h3>\n<p>One could think:</p>\n<blockquote>“So you had two implementations already; just take the best of both worlds and kick it off. Bamm! Success!”</blockquote>\n<p>Well, it’s not that easy. First of all an organizing committee was created, consisting of Mathieu Guindon (Straumann Montreal), Julien Marbach (Straumann Montreal) and me, with the task to define how the Inno Week should look. We all had useful learnings from previous implementations:</p>\n<ol>\n<li>We saw that both of our versions attracted lots of very creative ideas. The key was to really let people come up with their own innovations, be that improving a product or a process or even just learning about a cool new idea.</li>\n<li>We also saw that bringing novel ideas to the roadmap required lots of effort. So we wanted to make sure that with the bigger implementation, we had well-defined processes to support that.</li>\n<li>We also saw that engaging people, mentoring, detailed reviews and different prizes (e.g. Best Clinical or Most Visionary) mean that such an Inno Week concept is much more than just a kickoff presentation. We had to think about how to extend the group of organizers and which “features” of the previous implementations we really wanted to keep.</li>\n</ol>\n<p>We also looked at implementations at other companies and learned from their insights too. Some quite interesting formats to support innovation are (or were in the past) the <a href=\"https://www.atlassian.com/company/shipit\">Atlassian ShipIt</a>, <a href=\"https://abc.xyz/investor/founders-letters/ipo-letter/\">Google’s 20% rule</a> and <a href=\"https://www.wired.com/1998/01/the-15-percent-solution/\">3M 15%</a> solution.</p>\n<p>After some iterations involving Bas and Claude too, we arrived at a presentation that, on one slide, explained the concept (i.e. who, when, why, what) and were ready to start pitching it to all relevant stakeholders. Even though we had the top management’s buy-in, we still had to make sure that everyone understood the benefits of doing the Inno Week, since the cost (i.e. 1 week is diverted from the <a href=\"https://scaledagileframework.com/\">program increment</a> delivery) was clear.</p>\n<p>Our pitch was the following:</p>\n<ul>\n<li>\n<strong>Goal</strong>: testing, proving &amp; pitching new ideas with rapid prototypes, cross-pollination of knowledge &amp; skills, make sure we are at the forefront of digital innovation!</li>\n<li>\n<strong>Participation</strong>: anyone in the organization can participate, but please make sure you have managerial approval before the Inno Week.</li>\n<li>\n<strong>Topics</strong>: Inno Week topics can be either rapid prototyping, process improvement, or research on a hypothesis. Projects can be performed in a team or individually.</li>\n<li>\n<strong>Results</strong>: each team or individual participating in the Inno Week should end with a demo (preferred), presentation (max 10 slide) or a video (max 3 min) of their results, this should be submitted to be considered for evaluation &amp; rewards.</li>\n<li>\n<strong>Governance</strong>: Inno Week is governed by the Innovation Committee and executed with the help of ambassadors who support participants &amp; champion innovation culture in the different locations.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GkXM6gYSntU6k1siBOrAnw.png\"><figcaption>The 5 keys to a successful Inno Week</figcaption></figure><p>This way, we clarified that the goal is not only direct innovation but also indirectly facilitating innovation by building bridges between teams that otherwise wouldn’t work together. On the participation side, we made sure that managers are an active part of the journey by giving them an overview of who is participating from their teams and the option to keep critical things in progress if needed. We made sure that it’s clear that while there are little limitations on the topics we have clear expectations on the outcome formats. This way people focus on reaching a presentable state by the end of the week. Finally, we started mapping the people who are committed to innovation in the different teams and onboarded them as ambassadors or asked them to join as organizers (this is how the great Albrecht Schnappauf joined us with his 30+ years in tangible innovation).</p>\n<h3>The first run of the new concept</h3>\n<p>The first iteration of the Inno Week was scheduled for the final week of the Q1 2024 program increment, just before the planning of the next quarter. We advertised it in the Software and Tech All Hands meeting, we connected with the overall Straumann innovation initiatives, we made sure that all questions were promptly answered and then we embraced for Monday, 18 Mar 2024, when the first run commenced. I was nervous that week because the stakes were high; we asked for one week from everyone, in return for bringing bottom-up innovations to processes and products.</p>\n<p>Luckily, we had quite promising signals: people submitted more than 80 ideas, and more than 250 colleagues checked them out, engaging in different ways: likes, upvotes and comments. This meant we had quite a good chance of booking some success already in the first iteration because one thing we were sure of: we were going to learn a lot about what we would have to change in the next iteration. Probably the most important highlights are the following:</p>\n<ul>\n<li>We managed to involve <strong>almost all of the sites</strong> in the first iteration! Due to the timing (doing the Inno Week just before the planning of the next quarter) some teams opted for finishing their quarters rather than trying out this new format.</li>\n<li>We had some quite visible <strong>collaboration between sites,</strong> providing clear evidence of effective cross-pollination. I myself was even collaborating with a team I didn’t know beforehand, this helped me a lot in understanding better what kind of different experts are working in other sites.</li>\n<li>We had a few <strong>extremely promising projects</strong> that fitted perfectly the Group-wide innovation program, so we started preparing them together with the teams for a submission.</li>\n</ul>\n<p>There were also some lowlights that we had to think about:</p>\n<ul>\n<li>The <strong>timing</strong> of the first Inno Week was not ideal. Before the PI planning, everybody is still in the crazy last push to meet the goals. In this context, the Inno Week could come across as a distraction, so we had to work with the software portfolio management team to get a better timing for the next iterations.</li>\n<li>Our <strong>onboarding of the ambassadors</strong> was not perfect. Some of them said they weren’t sure about what they should do, and a few of them admitted that they didn’t get the concept clear either. While we did our best, we learned that you should never underestimate the difficulty of communicating something in a simple narrative so everyone understands it.</li>\n<li>Our communication about the aim and definition of the Inno Week was not clear enough in some areas of the <a href=\"https://erinmeyer.com/books/the-culture-map/\">culture map</a>. Some cultures would participate to win prizes, some simply to try out new things, for others the idea of bottom-up innovation does not come naturally. This means, again, that we had to be very clear with our communication and, for some sites, do additional onboarding sessions.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*NAEjCwrbBiaG1RiO18cj-A.png\"><figcaption>Reflection on the first Inno Week</figcaption></figure><p>Three highlights and three lowlights, so was it a success? We were introducing a new concept, so the most important KPI for us was to have enough traction/success for this first iteration to make a second iteration possible. And that was clearly there. As a matter of fact, I’m writing this during the third iteration when I chose this blog post as my project.</p>\n<h3>An environment that fosters innovation</h3>\n<p>Now, almost one year after we started working on the implementation of the Inno Week, we see it as a stable part of our culture. There are some solid successes fueling it; both with building bridges between teams and with product enhancements already being rolled out to users of our digital portfolio. We also see many smaller daily reminders of the benefits of bottom-up innovation, like an easier request form, a more stable CI, or an updated tooling. We are still not at the point where everyone is participating in the Inno Week, but ultimately, it’s not the goal either. The aim is to provide a format that allows ideas to be tested quickly and learn from people you would otherwise not necessarily meet. These small things make big companies enjoy some of the most important benefits of smaller startups, while also having the resources and maturity to make a stable global impact.</p>\n<p>On a more personal side, I’m proud that this crucial component of Promaton’s culture is flowing into the culture of Straumann Group. It’s a good thing and it fueled so many of our innovations, so it is amazing to see it working now on a much bigger scale too. Obviously, this couldn’t be done without the support of key members of the Executive Management Board of Straumann (Thomas Friese and Florian Kirsch) and without the hard work and dedication of Mathieu, Julien, Claude and Bas (see above).</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=585c2721de17\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://blog.promaton.com/the-power-of-a-single-week-dedicated-to-innovation-585c2721de17\">The Power of a Single Week Dedicated to Innovation</a> was originally published in <a href=\"https://blog.promaton.com/\">Promaton</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["innovation-culture","company-culture","startup-lessons","dentistry","corporate-culture"]},{"title":"Why Copying Tech Giants May Hurt Your Startup","pubDate":"2024-11-21 02:54:46","link":"https://medium.datadriveninvestor.com/the-google-trap-why-copying-tech-giants-may-hurt-your-startup-3b36aae9dc9c?source=rss-798a10893c3e------2","guid":"https://medium.com/p/3b36aae9dc9c","author":"Ágoston Török","thumbnail":"","description":"\n<h4>Explained with a Dead Simple Analogy</h4>\n<p>At my first startup, we eagerly looked to adapt the latest methodologies from tech giants like Google, Netflix, and Amazon. We thought, if it works for them, it should work for us, right? But over time, I became more and more cautious. Don’t get me wrong; their solutions are smart. However, I began to realize that they might be smart solutions for the challenges of a different company.</p>\n<h3>David vs. Goliath</h3>\n<p>I’m not talking about differences in geography or market. I’m talking about the difference in <strong>age and maturity</strong>. I started to feel that perhaps some simpler methods would be more effective at the stage our company was in. Sure, they might not scale in the long run, but is that a good enough reason not to adopt them while they still work?</p>\n<p>The thing became most clear to me when I wanted to invite a friend — a product manager at one of the FAANG companies — to give a talk about their methods. She told me she could share their secret in just one sentence:</p>\n<blockquote>“We spend an unfathomable sum on R&amp;D”</blockquote>\n<p>To put this into perspective, Google’s parent company, Alphabet, spent <strong>$45 billion</strong> on R&amp;D in <a href=\"https://www.macrotrends.net/stocks/charts/GOOGL/alphabet/research-development-expenses\">2023</a>. Given a headcount of 180,000 employees that <a href=\"https://tradingeconomics.com/goog:us:employees\">year</a>, they spent around <strong>$250,000 per employee</strong>. Obviously, only a fraction of those employees work in R&amp;D, so the actual spend per R&amp;D employee is much higher.</p>\n<p>Let’s take it one step further: for your startup with just <strong>ten people</strong>, you’d need to spend <strong>$2.5 million annually on only R&amp;D</strong> to match that per-employee expenditure. For reference, consider that <a href=\"https://bwdisrupt.com/article/health-tech-startup-healthify-secures-funding-of-20-mn-537267\">Healthify</a> recently received <strong>$20 million</strong> in funding. Given their size, that amount would fund their R&amp;D for just <strong>over two weeks </strong>with the Alphabet rate.</p>\n<p>Of course, this isn’t realistic for a startup. But does this mean we’re all just waiting to join the <a href=\"https://news.ycombinator.com/item?id=31377826\">list of companies</a> killed by Big Tech? Oh, far from it. Quite the opposite. Let me share a helpful analogy and some strategic considerations that helped me understand why this isn’t the case.</p>\n<p>Of course, this is not realistic. But is it then that we are all just waiting to join the <a href=\"https://news.ycombinator.com/item?id=31377826\">list of companies</a> killed by Big Tech? Oh, far from that. Quite the opposite; I’m going to present you a helpful analogy and some visual strategy considerations that helped me understand why this is so true.</p>\n<h3>The $250,000 Per Employee Question</h3>\n<p>Suppose you and your friend decided to create a startup in your garage and got a $100,000 investment from an angel investor to develop your MVP in 12 months. In that case, you’d roughly spend $50,000 on R&amp;D per employee (assuming no sales, marketing, and other <a href=\"https://en.wikipedia.org/wiki/Operating_expense\">OPEX</a>). That’s one-fifth of what Google spends. So can you compete with Google? Or could they just decide tomorrow to build your product faster and better with their world-class team?</p>\n<p>Yes and no.</p>\n<p><strong>Yes</strong>, because Big Tech companies strive to preserve their agility. For example, after the release of ChatGPT in November 2022, Google was beta-testing Bard with 10,000 users by February 2023. They can move quickly when they need to.</p>\n<p>But also <strong>no</strong>, because Big Tech operates in the commodity space — they are <strong>“corporate agile.”</strong> Some of you may be surprised to hear this but yes they are innovative companies but yes also their consumers expect a quality-level that is the standard in the commodity space. They have to navigate complex processes and contexts that just don’t exist for you. Releasing a product as a tech giant involves media scrutiny and the risk of affecting stock prices. Their very size slows them down in ways that you, as a startup, are not hindered by.</p>\n<blockquote>On the other hand, you and your friend in your fresh startup can take paths that don’t exist in Big Tech anymore.</blockquote>\n<p>You can move faster and take risks without worrying about shareholder reaction. It’s just the two of you, so so <a href=\"https://en.wikipedia.org/wiki/Parkinson's_law\">that’s what it’s going to take</a> to build the MVP.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*siLksRleGLiRMnZ_EhhuLg.png\"><figcaption>Fig 2. The Innovator’s Dilemma. Google’s (1) strategy to the growth of ChatGPT meant launching a comprehensive generative AI solution designed to compete directly and recapture users for the Google ecosystem. On the other hand, for a startup like Anthropic (2), an entirely different but perfectly reasonable strategy involved focusing on a specific market segment — namely, customers sensitive to safety and security concerns (notice the slight difference in the position and size of the customer). Notation according to the <a href=\"https://medium.com/p/2e6232e4578f\">Wardley-Torok model</a>.</figcaption></figure><p>The crazy thing is that although both you and Big Tech need to move to different terrains to release a product, your motion will be rightward while Big Tech will need to do a leftward move (Fig 2). The natural progression is rightward — toward growth and complexity. So even without $250,000 per employee, you stand a fair chance of being successful with your disruptive product.</p>\n<blockquote>This is the essence of the <a href=\"https://en.wikipedia.org/wiki/The_Innovator%27s_Dilemma\"><strong>innovator’s dilemma</strong></a>.</blockquote>\n<p>It’s partly why ChatGPT <a href=\"https://www.statista.com/statistics/1454331/united-states-chatgpt-gemini-app-downloads/\">wins</a> over Gemini today, and why Google <a href=\"https://www.pewresearch.org/internet/2005/11/20/big-jump-in-search-engine-use/\">won</a> over Yahoo in the 2000s.</p>\n<h3><strong>The Charm of MVPs</strong></h3>\n<p>One downside of commodities is the lack of any level of personalization. Think about how annoying it is to carry a travel adapter every time you visit a different continent. <strong>MVPs still offer diversity and specialization</strong>.</p>\n<p>The <a href=\"https://www.synetiq.net/\">first startup</a> I was part of used sensors to measure people’s reactions to ads, helping brands understand which videos resonated with their customers. We had a significant “competitor” in the US: <strong>Affectiva</strong>. I use the term “competitor” loosely because we quickly realized that while Affectiva operated in many countries (they measured consumer reactions in 90 countries on 53,000 ads), there were other areas where our product could better address local needs.</p>\n<p>There, I worked alongside the best salesperson I’ve ever known. Her skills helped us thrive in <strong>Central Europe</strong>, measuring <a href=\"https://www.synetiq.net/solutions\">12,000 ads for more than 80 customers like <strong>Ikea, HBO, Tesco</strong> etc</a>. The key was knowing the area we operated in and tailoring our message and approach to that.</p>\n<p>The reason I’m telling this is that you should first have a plan to win in your niche before you aspire to build a castle in the platform and commodity space. Understand your market, your customers, and your unique advantages. And when you look for methods, consider searching for successful companies of your size and business stage instead of just copying the wisdom of experts in the commodity space.</p>\n<p>Visit us at <a href=\"https://www.datadriveninvestor.com/\"><em>DataDrivenInvestor.com</em></a></p>\n<p>Subscribe to DDIntel <a href=\"https://www.ddintel.com/\"><em>here</em></a>.</p>\n<p>Join our creator ecosystem <a href=\"https://join.datadriveninvestor.com/\"><em>here</em></a>.</p>\n<p>DDI Official Telegram Channel: <a href=\"https://t.me/+tafUp6ecEys4YjQ1\">https://t.me/+tafUp6ecEys4YjQ1</a></p>\n<p>Follow us on <a href=\"https://www.linkedin.com/company/data-driven-investor\"><em>LinkedIn</em></a>, <a href=\"https://twitter.com/@DDInvestorHQ\"><em>Twitter</em></a>, <a href=\"https://www.youtube.com/c/datadriveninvestor\"><em>YouTube</em></a>, and <a href=\"https://www.facebook.com/datadriveninvestor\"><em>Facebook</em></a>.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3b36aae9dc9c\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/the-google-trap-why-copying-tech-giants-may-hurt-your-startup-3b36aae9dc9c\">Why Copying Tech Giants May Hurt Your Startup</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h4>Explained with a Dead Simple Analogy</h4>\n<p>At my first startup, we eagerly looked to adapt the latest methodologies from tech giants like Google, Netflix, and Amazon. We thought, if it works for them, it should work for us, right? But over time, I became more and more cautious. Don’t get me wrong; their solutions are smart. However, I began to realize that they might be smart solutions for the challenges of a different company.</p>\n<h3>David vs. Goliath</h3>\n<p>I’m not talking about differences in geography or market. I’m talking about the difference in <strong>age and maturity</strong>. I started to feel that perhaps some simpler methods would be more effective at the stage our company was in. Sure, they might not scale in the long run, but is that a good enough reason not to adopt them while they still work?</p>\n<p>The thing became most clear to me when I wanted to invite a friend — a product manager at one of the FAANG companies — to give a talk about their methods. She told me she could share their secret in just one sentence:</p>\n<blockquote>“We spend an unfathomable sum on R&amp;D”</blockquote>\n<p>To put this into perspective, Google’s parent company, Alphabet, spent <strong>$45 billion</strong> on R&amp;D in <a href=\"https://www.macrotrends.net/stocks/charts/GOOGL/alphabet/research-development-expenses\">2023</a>. Given a headcount of 180,000 employees that <a href=\"https://tradingeconomics.com/goog:us:employees\">year</a>, they spent around <strong>$250,000 per employee</strong>. Obviously, only a fraction of those employees work in R&amp;D, so the actual spend per R&amp;D employee is much higher.</p>\n<p>Let’s take it one step further: for your startup with just <strong>ten people</strong>, you’d need to spend <strong>$2.5 million annually on only R&amp;D</strong> to match that per-employee expenditure. For reference, consider that <a href=\"https://bwdisrupt.com/article/health-tech-startup-healthify-secures-funding-of-20-mn-537267\">Healthify</a> recently received <strong>$20 million</strong> in funding. Given their size, that amount would fund their R&amp;D for just <strong>over two weeks </strong>with the Alphabet rate.</p>\n<p>Of course, this isn’t realistic for a startup. But does this mean we’re all just waiting to join the <a href=\"https://news.ycombinator.com/item?id=31377826\">list of companies</a> killed by Big Tech? Oh, far from it. Quite the opposite. Let me share a helpful analogy and some strategic considerations that helped me understand why this isn’t the case.</p>\n<p>Of course, this is not realistic. But is it then that we are all just waiting to join the <a href=\"https://news.ycombinator.com/item?id=31377826\">list of companies</a> killed by Big Tech? Oh, far from that. Quite the opposite; I’m going to present you a helpful analogy and some visual strategy considerations that helped me understand why this is so true.</p>\n<h3>The $250,000 Per Employee Question</h3>\n<p>Suppose you and your friend decided to create a startup in your garage and got a $100,000 investment from an angel investor to develop your MVP in 12 months. In that case, you’d roughly spend $50,000 on R&amp;D per employee (assuming no sales, marketing, and other <a href=\"https://en.wikipedia.org/wiki/Operating_expense\">OPEX</a>). That’s one-fifth of what Google spends. So can you compete with Google? Or could they just decide tomorrow to build your product faster and better with their world-class team?</p>\n<p>Yes and no.</p>\n<p><strong>Yes</strong>, because Big Tech companies strive to preserve their agility. For example, after the release of ChatGPT in November 2022, Google was beta-testing Bard with 10,000 users by February 2023. They can move quickly when they need to.</p>\n<p>But also <strong>no</strong>, because Big Tech operates in the commodity space — they are <strong>“corporate agile.”</strong> Some of you may be surprised to hear this but yes they are innovative companies but yes also their consumers expect a quality-level that is the standard in the commodity space. They have to navigate complex processes and contexts that just don’t exist for you. Releasing a product as a tech giant involves media scrutiny and the risk of affecting stock prices. Their very size slows them down in ways that you, as a startup, are not hindered by.</p>\n<blockquote>On the other hand, you and your friend in your fresh startup can take paths that don’t exist in Big Tech anymore.</blockquote>\n<p>You can move faster and take risks without worrying about shareholder reaction. It’s just the two of you, so so <a href=\"https://en.wikipedia.org/wiki/Parkinson's_law\">that’s what it’s going to take</a> to build the MVP.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*siLksRleGLiRMnZ_EhhuLg.png\"><figcaption>Fig 2. The Innovator’s Dilemma. Google’s (1) strategy to the growth of ChatGPT meant launching a comprehensive generative AI solution designed to compete directly and recapture users for the Google ecosystem. On the other hand, for a startup like Anthropic (2), an entirely different but perfectly reasonable strategy involved focusing on a specific market segment — namely, customers sensitive to safety and security concerns (notice the slight difference in the position and size of the customer). Notation according to the <a href=\"https://medium.com/p/2e6232e4578f\">Wardley-Torok model</a>.</figcaption></figure><p>The crazy thing is that although both you and Big Tech need to move to different terrains to release a product, your motion will be rightward while Big Tech will need to do a leftward move (Fig 2). The natural progression is rightward — toward growth and complexity. So even without $250,000 per employee, you stand a fair chance of being successful with your disruptive product.</p>\n<blockquote>This is the essence of the <a href=\"https://en.wikipedia.org/wiki/The_Innovator%27s_Dilemma\"><strong>innovator’s dilemma</strong></a>.</blockquote>\n<p>It’s partly why ChatGPT <a href=\"https://www.statista.com/statistics/1454331/united-states-chatgpt-gemini-app-downloads/\">wins</a> over Gemini today, and why Google <a href=\"https://www.pewresearch.org/internet/2005/11/20/big-jump-in-search-engine-use/\">won</a> over Yahoo in the 2000s.</p>\n<h3><strong>The Charm of MVPs</strong></h3>\n<p>One downside of commodities is the lack of any level of personalization. Think about how annoying it is to carry a travel adapter every time you visit a different continent. <strong>MVPs still offer diversity and specialization</strong>.</p>\n<p>The <a href=\"https://www.synetiq.net/\">first startup</a> I was part of used sensors to measure people’s reactions to ads, helping brands understand which videos resonated with their customers. We had a significant “competitor” in the US: <strong>Affectiva</strong>. I use the term “competitor” loosely because we quickly realized that while Affectiva operated in many countries (they measured consumer reactions in 90 countries on 53,000 ads), there were other areas where our product could better address local needs.</p>\n<p>There, I worked alongside the best salesperson I’ve ever known. Her skills helped us thrive in <strong>Central Europe</strong>, measuring <a href=\"https://www.synetiq.net/solutions\">12,000 ads for more than 80 customers like <strong>Ikea, HBO, Tesco</strong> etc</a>. The key was knowing the area we operated in and tailoring our message and approach to that.</p>\n<p>The reason I’m telling this is that you should first have a plan to win in your niche before you aspire to build a castle in the platform and commodity space. Understand your market, your customers, and your unique advantages. And when you look for methods, consider searching for successful companies of your size and business stage instead of just copying the wisdom of experts in the commodity space.</p>\n<p>Visit us at <a href=\"https://www.datadriveninvestor.com/\"><em>DataDrivenInvestor.com</em></a></p>\n<p>Subscribe to DDIntel <a href=\"https://www.ddintel.com/\"><em>here</em></a>.</p>\n<p>Join our creator ecosystem <a href=\"https://join.datadriveninvestor.com/\"><em>here</em></a>.</p>\n<p>DDI Official Telegram Channel: <a href=\"https://t.me/+tafUp6ecEys4YjQ1\">https://t.me/+tafUp6ecEys4YjQ1</a></p>\n<p>Follow us on <a href=\"https://www.linkedin.com/company/data-driven-investor\"><em>LinkedIn</em></a>, <a href=\"https://twitter.com/@DDInvestorHQ\"><em>Twitter</em></a>, <a href=\"https://www.youtube.com/c/datadriveninvestor\"><em>YouTube</em></a>, and <a href=\"https://www.facebook.com/datadriveninvestor\"><em>Facebook</em></a>.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3b36aae9dc9c\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/the-google-trap-why-copying-tech-giants-may-hurt-your-startup-3b36aae9dc9c\">Why Copying Tech Giants May Hurt Your Startup</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["product-management","technology","management","data","agile"]},{"title":"How to Draw a Strategy in 4 Steps","pubDate":"2024-10-09 13:49:48","link":"https://medium.datadriveninvestor.com/how-to-draw-a-strategy-in-4-steps-2e6232e4578f?source=rss-798a10893c3e------2","guid":"https://medium.com/p/2e6232e4578f","author":"Ágoston Török","thumbnail":"","description":"\n<h3>How to Draw a Strategy in 4 Easy Steps</h3>\n<h4>One strategic picture says more than a thousand strategic words</h4>\n<p>It took me writing three bad strategies before I finally started looking beyond my excuses and discovered the contours of a solution. With the following 10-minute read, I’d like to save you three months of work. That was the time I invested in writing those strategies, and although I learned a lot, I wish someone had told me what I’m about to share with you.</p>\n<h3>Why Is It So Difficult to Write a Strategy?</h3>\n<p>One of my first tasks as a CTO was to write an engineering strategy. I learned about our business, our technology, and the competitive landscape, and then wrote down an amazing vision of where we should go. The document was well-structured (i.e., it had three strategic pillars), featured all the buzzwords, and I was proud of myself.</p>\n<p>However, when I presented it to the CEO, he was not impressed. He told me that it should be connected to the company and product strategies instead of being a standalone document. I didn’t understand this comment because I thought I had done exactly that.</p>\n<p>Anyway, I revised the document and paid extra attention to connecting it to the product strategy. I included all the capabilities we discussed in meetings so the strategy wouldn’t have blind spots. When I felt ready, I showed it to the CEO… who was again unimpressed. His comment this time was that he missed tangible actions on what we should do. I was clueless again; I spent entire pages describing where we should be with the specific capabilities we have in one year. He acknowledged that but still felt this was not the holy grail.</p>\n<p>So I started again, this time from scratch. I’ve read <a href=\"https://lethain.com/eng-strategies/\">Will Larson’s</a>, <a href=\"https://www.goodreads.com/book/show/42414767-technology-strategy-patterns\">Eben Hewitt’s</a>, <a href=\"https://www.goodreads.com/book/show/44144493-fundamentals-of-software-architecture\">Mark Richards’</a>, <a href=\"https://www.goodreads.com/book/show/33369254-the-manager-s-path\">Camille Fournier’s</a>, and <a href=\"https://www.goodreads.com/book/show/11721966-good-strategy-bad-strategy\">Richard Rumelt’s</a> guidelines. You know, I’m the kind of person who, once he sets his mind to something, leaves no stone unturned in his efforts to accomplish it. And I was sure this time I was going to ace it. I looked at each of the things in motion, selected the ones that would lead us to the Promised Land, and wrote them down. I also learned from my mistake of writing a 12-page monster last time and wrote only 6 pages with lots of bullet points. I was ready to present it and collect the — by this time, really well-deserved — applause, flowers, and whatever authors of good strategy documents get.</p>\n<p>But I didn’t get any of those; instead, the CEO noted that it’s again a step in the right direction but lacks the overarching narrative and, more importantly, how we are going to address our most important challenges. I was devastated.</p>\n<blockquote>I just couldn’t understand how I could have failed at it three times and why it is so difficult to write a good strategy.</blockquote>\n<h3>Because You Have to Draw It</h3>\n<p>Amidst my desperation, I came across a <a href=\"https://www.youtube.com/watch?v=dcp6YMAmI3M\">talk from Simon Wardley</a>, creator of the Wardley maps. He started by describing his first strategy which was full of buzzwords and led nowhere. I felt he was describing mine. Then he showed how maps differ from graphs. It clicked immediately. I thought, “OMG, I’ve got the solution: it’s difficult to <em>write</em> a strategy because you have to <em>draw</em> it.” And then he explained Wardley maps in the remaining 40 minutes, and I immediately understood it and felt:</p>\n<blockquote>“Yes! Finally! I’ve got the solution to my problem! I have to create a Wardley map”</blockquote>\n<p>The whole idea is based on the notion that we have excellent visual reasoning skills in actual physical spaces where position and motion make sense. Therefore, Wardley maps use a 2D space (see Fig 1), where one dimension represents the <strong>Visibility of Value</strong> and the second one represents the <strong>Evolution of the Capability</strong>. Genius.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/567/1*gpPep-Crk_7lmViwqPJ1Pg.png\"><figcaption>Fig 1. An example value chain for an Artisan Tea House. Your main value offering could be the cup of tea, <em>whose value is supported by the prototype homemade artisan design of the cup, the well-trained staff, and commodities such as tea from a supplier. These further depend on other commodities such as cups from a ceramic maker and water from the utility provider. The connecting lines help map the value chain.</em></figcaption></figure><p>Visibility of Value combines the actual value with its visibility; this helps resolve the conflict that often happens between engineers and salespeople: one says something is of high value, and the other says, “Okay, but it is not visible.” Imagine this dimension as something like the time of day: night is low visibility, and noon is high visibility. This helps explain why it’s so difficult to get feedback and make things work smoothly together when they are buried deep in the value chain. At night, we have more trouble seeing the details of an object. Of course, if your eyes are used to the dark, you can be pretty efficient there, but a customer would have quite some trouble navigating it.</p>\n<p>Evolution is even more interesting. On the left-hand side, you have the spark that starts everything, and gradually you go through iterations to reach PoC (Proof of Concept), prototype, MVP (Minimum Viable Product), evolution, and finally become a commodity. This doesn’t mean that you always travel through the entire dimension; it’s just that, in principle, things can <strong>evolve</strong>, and in fact — on a global scale — things typically evolve into a commodity over time. But this is not an isometric space; in fact, moving from a mature product to a commodity and from PoC to prototype requires quite different approaches.</p>\n<p>Then what usually happens after a Eureka moment happened: I calmed down and started to think about it a bit more. Yes, the CEO would understand <strong>a</strong> map, but surely he wouldn’t watch the 40-minute “Learning About Wardley Maps” on YouTube to understand my map. And it’s valid; Wardley maps make perfect sense, but are they really intuitive?</p>\n<p>The problem is not really the axis labels (i.e. genesis to commodity) or that figures can include <a href=\"https://x.com/swardley/status/1640794194112577537\">lots of capabilities</a>. If you have ever seen a <a href=\"https://smarts-ef.org/wp-content/uploads/2019/05/Gainess_Mill_1430.png\">military strategy visualization</a> then that is also often full of labels which are similarly difficult to understand unless you know the geographic area. However, what they do very clearly is representing dynamics and challenges (in the case of military maps, those are typically the enemy).</p>\n<h3>When an Image Works Without Explanation</h3>\n<p>So I sat down and started to think about how I could show dynamics and challenges in an immediately accessible way. Luckily, during my PhD, I did quite a lot of research with my father on <a href=\"https://link.springer.com/chapter/10.1007/978-3-319-95996-2_3\">cognitive data visualizations</a>.</p>\n<p>The thing that military strategy figures do well is to represent opposing forces: us and our threats. This is one of the things that is missing from regular Wardley maps. It is easily fixable though, I just have to mirror the space vertically and then I have a place (with an inverted Visibility axis) for the threats. Another thing missing is an intuitive visualization of time. But military strategy maps visualize nicely time too, either by using different <a href=\"https://kosmossociety.org/wp-content/uploads/2018/04/Gaugamela-Two.jpg\">type of line</a>, or <a href=\"https://www.battlefields.org/sites/default/files/styles/wysiwyg_original/public/Brandy-Station--Fleetwood-Hill-Fight--June-9-1863-%28May-2024%29.jpg?itok=6OqawOm9\">different type of arrow</a>, or other notation (<a href=\"https://en.wikipedia.org/wiki/Military_strategy#/media/File:Waterloo_Campaign_map-alt3.svg\">e.g. numbers</a>). I opted for using simple arrows for the past and double-sided/filled arrows for the planned movements.</p>\n<p>So let’s see see how to draw strategy in four steps now (see Fig 2).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*bJQgyOgpdE9mNW3NC2gOUg.png\"><figcaption>Fig 2. First (1) you map you value chain. Then (2) you map your threats and challenges. Then (3) you add how those items changed in the past. Finally, (4) you add how they would/should move in the future.</figcaption></figure><ol>\n<li>\n<strong>Map your value chain</strong>: follow the tutorial by <a href=\"https://www.youtube.com/watch?v=IJcLmoKR6v8\">Ben Mosior</a> to map your value chain in a Wardley-map.</li>\n<li>\n<strong>Map your threats:</strong> there are multiple ways to do it; the easiest is to just think about what could make it more difficult (or impossible) to meet the customer demand. It could be that there are some hypothetical threats (Less evolved, Low visibility), or something is a risk in the PoC stage but we are confident we will fix it (More evolved, higher visibility), or you know that the cloud provider is going to increase prices next year; you just don’t know by how much (Highly evolved, low visibility).</li>\n<li>\n<strong>Add past movements:</strong> it’s time to add dynamics. Think about how things changed over the past few months. At this point, you should start to watch out for introducing too much clutter to the image. Are there any connecting supply lines that you can remove because they are self-explanatory? Or are there lines which are not so well established in reality (especially, threats may not form one single “threat-chain”)? Are there any past motions that you can leave undisplayed without altering the overall picture? E.g. small movements could mean practically that the capability was “at rest” rather.</li>\n<li>\n<strong>Add future movements</strong>: look at the figure and imagine the system’s inertia: things that were moving continue to move, and things that were at rest would stay at rest. Draw these in with blue for threats and red for assets. Now think about where you would need to redirect the arrows to make sure you meet the customer's need. The point is not to get all your capabilities where the customer is, you just have to provide enough support for your product that it can deliver.</li>\n</ol>\n<blockquote>Now, you just have to figure out what you need to do in real life to make those changes in direction. These are your <strong>strategic actions</strong>.</blockquote>\n<p>Done. I call this <strong>Wardley-Torok mapping</strong>.</p>\n<h3>Let’s See Some Practical Examples</h3>\n<p>My favorite is <strong>the case of feature overengineering</strong>. Let’s say a manager asks an engineer to develop a feature. The engineer starts to work on it and is giving only low-level updates. Meanwhile, the manager's fear is increasing that we will run out of time before the feature works. Finally, they meet, and the manager says that there is no more time; we have to show something. Then in the presentation, it turns out that the feature has all sorts of bells and whistles but is just not doing exactly what the customer minimally wanted.</p>\n<p>Let’s see where strategy mapping could have helped. You can see what the engineer would have drawn at the meeting before the presentation in Fig 3.1. In his representation, there were no issues; it was just a matter of showing the great and mature product. In reality, though, despite the product’s high evolution, it didn’t include the features the customer needed (Fig 3.2). So the optimal choice would have been to learn what the customer actually wanted and make the necessary changes, even if that means incurring technical debt (i.e. making the product less mature).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*XSxPsMv1iwwv6zFBptIMkg.png\"><figcaption>Fig 3. Perception matters. On the left (1) you can see a view of the engineer working on a capability, who believes the customer wanted all the implemented features and now they have only to show the ready work. On the right (1) you see an example when this is actually overengineering, here the capability has higher evolution than the customer wanted. Here it’s clear that the previous “strategy” would not be the right choice. Rather, they have to learn about what the customer wanted and modify the design.</figcaption></figure><p>You can also see that I’m not talking here about the strategy of the company or the manager. Many think that strategic thinking is only required for people high up in the management ladder; I believe the opposite:</p>\n<blockquote>We need easier ways to talk about strategy so that everyone can participate in the discussion.</blockquote>\n<p>Let’s think a bit more about how important is how we place things in this space. Take another <strong>example: a wrong estimate</strong>. Here your manager comes to you and asks how much it would cost to manufacture 1 million units of the prototype you’ve just put together. You look at the price of putting together the prototype, divided it by two (i.e., economies of scale), multiply by a million, and say that it’s probably in that ballpark. Your manager forwards it to her manager without too much thinking, and you both consider the job done. However, at the next meeting, you find yourself in a crisis meeting because it turned out that you just killed the product before even launching it as the company can never make a profit at scale with these numbers.</p>\n<p>Now, depending on how you represent the threat, the chosen actions will differ. If you perceive (see Fig 4) the wrong estimate as an evolved (x-axis) and highly visible (y-axis) threat that indicates a substantial chance that the product would not scale, you might be tempted to go ahead and optimize it, cut costs, and ensure that you release something that would scale. The cost of this is that you waste time and miss your early adopters, who would have been happy to buy it even at a higher price or would have given you enough marketing so that it’s worth it to lose money on the unit price.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*CD8raGeh4n5GmO5MAvgoBQ.png\"><figcaption>Fig 4. <em>Perception primes action. On the left (1) we see a situation where the threat is perceived as quite an evolved threat with relatively high visibility, and it attracts the team’s focus away from the customer’s immediate needs. On the right (2) we see another representation of the situation with similar visibility but much less evolved, which requires a different action from the team.</em></figcaption></figure><p>On the other hand, you could also see that this wrong estimate drew attention to the fears behind the scalability of the product. But at this point, you could address these fears simply by making a better estimate, without investing any work into premature optimization and committing to delays. Which perception is right? Depends on the situation.</p>\n<blockquote>Your strategy is a hypothesis for the best action based on the analysis of the situation</blockquote>\n<p>Also, you don’t necessarily have to fight threats. Like in the example of Fig 5, you can simply say to the stakeholders that, yes indeed, we have concerns about the scalability of the product, but an even bigger challenge is to find product-market fit. And that’s our focus with the release of the MVP to the first 1,000 users. We will deal with all other priorities later.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/567/1*cstZKC-z9cwWAnDeiZdnmw.png\"><figcaption>Fig 5. <em>Representation drives strategy choice. In the above case, one could easily see the fears about lack of scalability as addressable but still opt for delivering a “non-scalable” MVP to get early customer feedback before embarking on optimization for scalability.</em></figcaption></figure><h3><strong>So What Did I Learn from My Three Failed Attempts?</strong></h3>\n<p>Now, thanks to Wardley-Torok maps, I can show <strong>exactly</strong> what the issues were with my strategies. And of course, in hindsight, it all makes perfect sense.</p>\n<p>In the first strategy (see Fig 6), I wrote down things that are all cool and would probably be the right steps for one company or another, but I totally missed understanding our company (i.e., what our value add is to our customers).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*8nbZP9FVwACnFkb6U2lQZQ.png\"><figcaption><em>Fig 6. Simplified Wardley-Torok maps of my three strategies. Dashed lines indicate the missing components. First (1) I just wrote up all cool and shiny things but didn’t understand our value offering to customers deeply enough. Then (2) I understood the value offering and described an optimal target state of our capabilities but didn’t write down how to get there. Finally (3), I collected all critical parts of our value chain and indicated the forces we have in the system, but I didn’t specify which strategic choices about changes of direction we have to make.</em></figcaption></figure><p>Then in the next one, I understood that correctly and even our specific value chain, but I mostly mapped the target states and not how to get there, which is a vision and not a strategy. Then, in my last one, I correctly mapped the dynamics and in some cases recognized that we should make some fine-tunings. But without the strategic actions, I just made a good snapshot of our organization’s inertia. Luckily, from here you can see that I’m very close to the actual strategy; it just took three months of work to get there without the mapping I described above. So I thought I would save you some time by just showing it to you.</p>\n<p>This model is licensed CC BY-SA 4.0</p>\n<p>Visit us at <a href=\"https://www.datadriveninvestor.com/\"><em>DataDrivenInvestor.com</em></a></p>\n<p>Subscribe to DDIntel <a href=\"https://www.ddintel.com/\"><em>here</em></a>.</p>\n<p>Join our creator ecosystem <a href=\"https://join.datadriveninvestor.com/\"><em>here</em></a>.</p>\n<p>DDI Official Telegram Channel: <a href=\"https://t.me/+tafUp6ecEys4YjQ1\">https://t.me/+tafUp6ecEys4YjQ1</a></p>\n<p>Follow us on <a href=\"https://www.linkedin.com/company/data-driven-investor\"><em>LinkedIn</em></a>, <a href=\"https://twitter.com/@DDInvestorHQ\"><em>Twitter</em></a>, <a href=\"https://www.youtube.com/c/datadriveninvestor\"><em>YouTube</em></a>, and <a href=\"https://www.facebook.com/datadriveninvestor\"><em>Facebook</em></a>.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=2e6232e4578f\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/how-to-draw-a-strategy-in-4-steps-2e6232e4578f\">How to Draw a Strategy in 4 Steps</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h3>How to Draw a Strategy in 4 Easy Steps</h3>\n<h4>One strategic picture says more than a thousand strategic words</h4>\n<p>It took me writing three bad strategies before I finally started looking beyond my excuses and discovered the contours of a solution. With the following 10-minute read, I’d like to save you three months of work. That was the time I invested in writing those strategies, and although I learned a lot, I wish someone had told me what I’m about to share with you.</p>\n<h3>Why Is It So Difficult to Write a Strategy?</h3>\n<p>One of my first tasks as a CTO was to write an engineering strategy. I learned about our business, our technology, and the competitive landscape, and then wrote down an amazing vision of where we should go. The document was well-structured (i.e., it had three strategic pillars), featured all the buzzwords, and I was proud of myself.</p>\n<p>However, when I presented it to the CEO, he was not impressed. He told me that it should be connected to the company and product strategies instead of being a standalone document. I didn’t understand this comment because I thought I had done exactly that.</p>\n<p>Anyway, I revised the document and paid extra attention to connecting it to the product strategy. I included all the capabilities we discussed in meetings so the strategy wouldn’t have blind spots. When I felt ready, I showed it to the CEO… who was again unimpressed. His comment this time was that he missed tangible actions on what we should do. I was clueless again; I spent entire pages describing where we should be with the specific capabilities we have in one year. He acknowledged that but still felt this was not the holy grail.</p>\n<p>So I started again, this time from scratch. I’ve read <a href=\"https://lethain.com/eng-strategies/\">Will Larson’s</a>, <a href=\"https://www.goodreads.com/book/show/42414767-technology-strategy-patterns\">Eben Hewitt’s</a>, <a href=\"https://www.goodreads.com/book/show/44144493-fundamentals-of-software-architecture\">Mark Richards’</a>, <a href=\"https://www.goodreads.com/book/show/33369254-the-manager-s-path\">Camille Fournier’s</a>, and <a href=\"https://www.goodreads.com/book/show/11721966-good-strategy-bad-strategy\">Richard Rumelt’s</a> guidelines. You know, I’m the kind of person who, once he sets his mind to something, leaves no stone unturned in his efforts to accomplish it. And I was sure this time I was going to ace it. I looked at each of the things in motion, selected the ones that would lead us to the Promised Land, and wrote them down. I also learned from my mistake of writing a 12-page monster last time and wrote only 6 pages with lots of bullet points. I was ready to present it and collect the — by this time, really well-deserved — applause, flowers, and whatever authors of good strategy documents get.</p>\n<p>But I didn’t get any of those; instead, the CEO noted that it’s again a step in the right direction but lacks the overarching narrative and, more importantly, how we are going to address our most important challenges. I was devastated.</p>\n<blockquote>I just couldn’t understand how I could have failed at it three times and why it is so difficult to write a good strategy.</blockquote>\n<h3>Because You Have to Draw It</h3>\n<p>Amidst my desperation, I came across a <a href=\"https://www.youtube.com/watch?v=dcp6YMAmI3M\">talk from Simon Wardley</a>, creator of the Wardley maps. He started by describing his first strategy which was full of buzzwords and led nowhere. I felt he was describing mine. Then he showed how maps differ from graphs. It clicked immediately. I thought, “OMG, I’ve got the solution: it’s difficult to <em>write</em> a strategy because you have to <em>draw</em> it.” And then he explained Wardley maps in the remaining 40 minutes, and I immediately understood it and felt:</p>\n<blockquote>“Yes! Finally! I’ve got the solution to my problem! I have to create a Wardley map”</blockquote>\n<p>The whole idea is based on the notion that we have excellent visual reasoning skills in actual physical spaces where position and motion make sense. Therefore, Wardley maps use a 2D space (see Fig 1), where one dimension represents the <strong>Visibility of Value</strong> and the second one represents the <strong>Evolution of the Capability</strong>. Genius.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/567/1*gpPep-Crk_7lmViwqPJ1Pg.png\"><figcaption>Fig 1. An example value chain for an Artisan Tea House. Your main value offering could be the cup of tea, <em>whose value is supported by the prototype homemade artisan design of the cup, the well-trained staff, and commodities such as tea from a supplier. These further depend on other commodities such as cups from a ceramic maker and water from the utility provider. The connecting lines help map the value chain.</em></figcaption></figure><p>Visibility of Value combines the actual value with its visibility; this helps resolve the conflict that often happens between engineers and salespeople: one says something is of high value, and the other says, “Okay, but it is not visible.” Imagine this dimension as something like the time of day: night is low visibility, and noon is high visibility. This helps explain why it’s so difficult to get feedback and make things work smoothly together when they are buried deep in the value chain. At night, we have more trouble seeing the details of an object. Of course, if your eyes are used to the dark, you can be pretty efficient there, but a customer would have quite some trouble navigating it.</p>\n<p>Evolution is even more interesting. On the left-hand side, you have the spark that starts everything, and gradually you go through iterations to reach PoC (Proof of Concept), prototype, MVP (Minimum Viable Product), evolution, and finally become a commodity. This doesn’t mean that you always travel through the entire dimension; it’s just that, in principle, things can <strong>evolve</strong>, and in fact — on a global scale — things typically evolve into a commodity over time. But this is not an isometric space; in fact, moving from a mature product to a commodity and from PoC to prototype requires quite different approaches.</p>\n<p>Then what usually happens after a Eureka moment happened: I calmed down and started to think about it a bit more. Yes, the CEO would understand <strong>a</strong> map, but surely he wouldn’t watch the 40-minute “Learning About Wardley Maps” on YouTube to understand my map. And it’s valid; Wardley maps make perfect sense, but are they really intuitive?</p>\n<p>The problem is not really the axis labels (i.e. genesis to commodity) or that figures can include <a href=\"https://x.com/swardley/status/1640794194112577537\">lots of capabilities</a>. If you have ever seen a <a href=\"https://smarts-ef.org/wp-content/uploads/2019/05/Gainess_Mill_1430.png\">military strategy visualization</a> then that is also often full of labels which are similarly difficult to understand unless you know the geographic area. However, what they do very clearly is representing dynamics and challenges (in the case of military maps, those are typically the enemy).</p>\n<h3>When an Image Works Without Explanation</h3>\n<p>So I sat down and started to think about how I could show dynamics and challenges in an immediately accessible way. Luckily, during my PhD, I did quite a lot of research with my father on <a href=\"https://link.springer.com/chapter/10.1007/978-3-319-95996-2_3\">cognitive data visualizations</a>.</p>\n<p>The thing that military strategy figures do well is to represent opposing forces: us and our threats. This is one of the things that is missing from regular Wardley maps. It is easily fixable though, I just have to mirror the space vertically and then I have a place (with an inverted Visibility axis) for the threats. Another thing missing is an intuitive visualization of time. But military strategy maps visualize nicely time too, either by using different <a href=\"https://kosmossociety.org/wp-content/uploads/2018/04/Gaugamela-Two.jpg\">type of line</a>, or <a href=\"https://www.battlefields.org/sites/default/files/styles/wysiwyg_original/public/Brandy-Station--Fleetwood-Hill-Fight--June-9-1863-%28May-2024%29.jpg?itok=6OqawOm9\">different type of arrow</a>, or other notation (<a href=\"https://en.wikipedia.org/wiki/Military_strategy#/media/File:Waterloo_Campaign_map-alt3.svg\">e.g. numbers</a>). I opted for using simple arrows for the past and double-sided/filled arrows for the planned movements.</p>\n<p>So let’s see see how to draw strategy in four steps now (see Fig 2).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*bJQgyOgpdE9mNW3NC2gOUg.png\"><figcaption>Fig 2. First (1) you map you value chain. Then (2) you map your threats and challenges. Then (3) you add how those items changed in the past. Finally, (4) you add how they would/should move in the future.</figcaption></figure><ol>\n<li>\n<strong>Map your value chain</strong>: follow the tutorial by <a href=\"https://www.youtube.com/watch?v=IJcLmoKR6v8\">Ben Mosior</a> to map your value chain in a Wardley-map.</li>\n<li>\n<strong>Map your threats:</strong> there are multiple ways to do it; the easiest is to just think about what could make it more difficult (or impossible) to meet the customer demand. It could be that there are some hypothetical threats (Less evolved, Low visibility), or something is a risk in the PoC stage but we are confident we will fix it (More evolved, higher visibility), or you know that the cloud provider is going to increase prices next year; you just don’t know by how much (Highly evolved, low visibility).</li>\n<li>\n<strong>Add past movements:</strong> it’s time to add dynamics. Think about how things changed over the past few months. At this point, you should start to watch out for introducing too much clutter to the image. Are there any connecting supply lines that you can remove because they are self-explanatory? Or are there lines which are not so well established in reality (especially, threats may not form one single “threat-chain”)? Are there any past motions that you can leave undisplayed without altering the overall picture? E.g. small movements could mean practically that the capability was “at rest” rather.</li>\n<li>\n<strong>Add future movements</strong>: look at the figure and imagine the system’s inertia: things that were moving continue to move, and things that were at rest would stay at rest. Draw these in with blue for threats and red for assets. Now think about where you would need to redirect the arrows to make sure you meet the customer's need. The point is not to get all your capabilities where the customer is, you just have to provide enough support for your product that it can deliver.</li>\n</ol>\n<blockquote>Now, you just have to figure out what you need to do in real life to make those changes in direction. These are your <strong>strategic actions</strong>.</blockquote>\n<p>Done. I call this <strong>Wardley-Torok mapping</strong>.</p>\n<h3>Let’s See Some Practical Examples</h3>\n<p>My favorite is <strong>the case of feature overengineering</strong>. Let’s say a manager asks an engineer to develop a feature. The engineer starts to work on it and is giving only low-level updates. Meanwhile, the manager's fear is increasing that we will run out of time before the feature works. Finally, they meet, and the manager says that there is no more time; we have to show something. Then in the presentation, it turns out that the feature has all sorts of bells and whistles but is just not doing exactly what the customer minimally wanted.</p>\n<p>Let’s see where strategy mapping could have helped. You can see what the engineer would have drawn at the meeting before the presentation in Fig 3.1. In his representation, there were no issues; it was just a matter of showing the great and mature product. In reality, though, despite the product’s high evolution, it didn’t include the features the customer needed (Fig 3.2). So the optimal choice would have been to learn what the customer actually wanted and make the necessary changes, even if that means incurring technical debt (i.e. making the product less mature).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*XSxPsMv1iwwv6zFBptIMkg.png\"><figcaption>Fig 3. Perception matters. On the left (1) you can see a view of the engineer working on a capability, who believes the customer wanted all the implemented features and now they have only to show the ready work. On the right (1) you see an example when this is actually overengineering, here the capability has higher evolution than the customer wanted. Here it’s clear that the previous “strategy” would not be the right choice. Rather, they have to learn about what the customer wanted and modify the design.</figcaption></figure><p>You can also see that I’m not talking here about the strategy of the company or the manager. Many think that strategic thinking is only required for people high up in the management ladder; I believe the opposite:</p>\n<blockquote>We need easier ways to talk about strategy so that everyone can participate in the discussion.</blockquote>\n<p>Let’s think a bit more about how important is how we place things in this space. Take another <strong>example: a wrong estimate</strong>. Here your manager comes to you and asks how much it would cost to manufacture 1 million units of the prototype you’ve just put together. You look at the price of putting together the prototype, divided it by two (i.e., economies of scale), multiply by a million, and say that it’s probably in that ballpark. Your manager forwards it to her manager without too much thinking, and you both consider the job done. However, at the next meeting, you find yourself in a crisis meeting because it turned out that you just killed the product before even launching it as the company can never make a profit at scale with these numbers.</p>\n<p>Now, depending on how you represent the threat, the chosen actions will differ. If you perceive (see Fig 4) the wrong estimate as an evolved (x-axis) and highly visible (y-axis) threat that indicates a substantial chance that the product would not scale, you might be tempted to go ahead and optimize it, cut costs, and ensure that you release something that would scale. The cost of this is that you waste time and miss your early adopters, who would have been happy to buy it even at a higher price or would have given you enough marketing so that it’s worth it to lose money on the unit price.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*CD8raGeh4n5GmO5MAvgoBQ.png\"><figcaption>Fig 4. <em>Perception primes action. On the left (1) we see a situation where the threat is perceived as quite an evolved threat with relatively high visibility, and it attracts the team’s focus away from the customer’s immediate needs. On the right (2) we see another representation of the situation with similar visibility but much less evolved, which requires a different action from the team.</em></figcaption></figure><p>On the other hand, you could also see that this wrong estimate drew attention to the fears behind the scalability of the product. But at this point, you could address these fears simply by making a better estimate, without investing any work into premature optimization and committing to delays. Which perception is right? Depends on the situation.</p>\n<blockquote>Your strategy is a hypothesis for the best action based on the analysis of the situation</blockquote>\n<p>Also, you don’t necessarily have to fight threats. Like in the example of Fig 5, you can simply say to the stakeholders that, yes indeed, we have concerns about the scalability of the product, but an even bigger challenge is to find product-market fit. And that’s our focus with the release of the MVP to the first 1,000 users. We will deal with all other priorities later.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/567/1*cstZKC-z9cwWAnDeiZdnmw.png\"><figcaption>Fig 5. <em>Representation drives strategy choice. In the above case, one could easily see the fears about lack of scalability as addressable but still opt for delivering a “non-scalable” MVP to get early customer feedback before embarking on optimization for scalability.</em></figcaption></figure><h3><strong>So What Did I Learn from My Three Failed Attempts?</strong></h3>\n<p>Now, thanks to Wardley-Torok maps, I can show <strong>exactly</strong> what the issues were with my strategies. And of course, in hindsight, it all makes perfect sense.</p>\n<p>In the first strategy (see Fig 6), I wrote down things that are all cool and would probably be the right steps for one company or another, but I totally missed understanding our company (i.e., what our value add is to our customers).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*8nbZP9FVwACnFkb6U2lQZQ.png\"><figcaption><em>Fig 6. Simplified Wardley-Torok maps of my three strategies. Dashed lines indicate the missing components. First (1) I just wrote up all cool and shiny things but didn’t understand our value offering to customers deeply enough. Then (2) I understood the value offering and described an optimal target state of our capabilities but didn’t write down how to get there. Finally (3), I collected all critical parts of our value chain and indicated the forces we have in the system, but I didn’t specify which strategic choices about changes of direction we have to make.</em></figcaption></figure><p>Then in the next one, I understood that correctly and even our specific value chain, but I mostly mapped the target states and not how to get there, which is a vision and not a strategy. Then, in my last one, I correctly mapped the dynamics and in some cases recognized that we should make some fine-tunings. But without the strategic actions, I just made a good snapshot of our organization’s inertia. Luckily, from here you can see that I’m very close to the actual strategy; it just took three months of work to get there without the mapping I described above. So I thought I would save you some time by just showing it to you.</p>\n<p>This model is licensed CC BY-SA 4.0</p>\n<p>Visit us at <a href=\"https://www.datadriveninvestor.com/\"><em>DataDrivenInvestor.com</em></a></p>\n<p>Subscribe to DDIntel <a href=\"https://www.ddintel.com/\"><em>here</em></a>.</p>\n<p>Join our creator ecosystem <a href=\"https://join.datadriveninvestor.com/\"><em>here</em></a>.</p>\n<p>DDI Official Telegram Channel: <a href=\"https://t.me/+tafUp6ecEys4YjQ1\">https://t.me/+tafUp6ecEys4YjQ1</a></p>\n<p>Follow us on <a href=\"https://www.linkedin.com/company/data-driven-investor\"><em>LinkedIn</em></a>, <a href=\"https://twitter.com/@DDInvestorHQ\"><em>Twitter</em></a>, <a href=\"https://www.youtube.com/c/datadriveninvestor\"><em>YouTube</em></a>, and <a href=\"https://www.facebook.com/datadriveninvestor\"><em>Facebook</em></a>.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=2e6232e4578f\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/how-to-draw-a-strategy-in-4-steps-2e6232e4578f\">How to Draw a Strategy in 4 Steps</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["strategy","storytelling","leadership","wardley-maps","management"]},{"title":"The Most Terrifying Game You Can Play with ChatGPT","pubDate":"2024-03-15 08:59:38","link":"https://generativeai.pub/the-most-terrifying-game-you-can-play-with-chatgpt-5075b7ee97e1?source=rss-798a10893c3e------2","guid":"https://medium.com/p/5075b7ee97e1","author":"Ágoston Török","thumbnail":"","description":"\n<h4>I wanted to develop a fun party game but the first time testing it left me deeply unsettled</h4>\n<p>As a child, I was captivated by social deduction games like Mafia and Werewolf. The thrill of hunting for clues as a villager or trying to hide during the daylight as the Mafiosi/werewolves was irresistible. The concept of group judgment has deep roots in human history, which is precisely why playing <a href=\"https://poe.com/RobotDetectiveGame\">The Robot Detective</a> game feels so unnerving.</p>\n<p>The setup is simple: a crime has been committed, there are ordinary civilians and the culprits are hiding among them. Up to this point, the game resembles a typical round of Mafia. The twist is that the players neither have to identify the perpetrators nor do they need to convince others of their innocence. Instead, a Robot Detective — played by an actual AI chatbot — interrogates all players and then decides whether someone is guilty or innocent.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*r2bX6QKKHvK4scZi7srxiQ.png\"><figcaption>The Robot Detective interrogates people in the game to decide who is guilty. Image generated with StableDiffusionXL</figcaption></figure><h3>The Imitation Game 2.0</h3>\n<p>The Robot Detective game offers a fresh take on Alan Turing’s test for intelligent behavior. In the original <a href=\"https://en.wikipedia.org/wiki/Turing_test\">imitation game</a>, a human is tasked with discerning which of their two interlocutors is a machine and which is human. When thinking of this design, we intrinsically put ourselves in the position of the human judge.</p>\n<p>However, there is another human participant in the imitation game: the one who risks being judged as less human than the machine. I remember the shock in <a href=\"https://www.newscientist.com/article/dn14925-almost-human-interview-with-a-chatbot/\">2008</a> when Elbot, a chatbot by <a href=\"https://en.wikipedia.org/wiki/Artificial_Solutions\">Artificial Solutions</a>, convinced three of the twelve judges in the Loebner prize competition that it was the true human conversation partner. It made me wonder how it would feel to be considered less human-like than a chatbot.</p>\n<p>The Robot Detective takes this to the next level in that the AI chatbot is the one who becomes the judge of humans. While this could easily be a scene from a dystopian sci-fi film, it mirrors current reality more closely than you might think. Today, we use AI systems to mimic human <a href=\"https://elevenlabs.io/\">voices</a>, interpret <a href=\"https://neuralink.com/\">thoughts</a> and <a href=\"https://www.affectiva.com/\">feelings</a>, and make decisions about mortgages and employment. Chances are that the last time you used a company’s support chat, you were speaking to an AI. Indeed, AI has become proficient… but far from infallible; especially in complex social, ethical, and moral situations. And this is exactly what The Robot Detective game helps us feel on our skins, luckily in a game context only.</p>\n<h3>Asimov’s Three Laws</h3>\n<p>In the game, the Robot Detective eliminates a player at the end of each round. Upon elimination, the player must reveal whether they were a civilian or a criminal. This dynamic keeps the game moving and allows the AI to showcase its deductive skills, as it must draw conclusions from very limited information.</p>\n<p>The information may not always be sparse though. While the game is ideally played with 4 to 6 participants, what if a single person wanted to try the game? To accommodate this scenario, I attempted to engineer a prompt simulating additional players (bots) with their respective roles (criminals vs. civilians). A problem with this was that by default the Robot Detective would have had access to all of this information. This would have been quite bad for the gameplay. Luckily, there are a few ways in which the model can be made to disregard parts of the prompt, so I experimented with several iterations.</p>\n<p>Even though based on these prompts, the Detective should not have known the identities of the bots, for quite some time I was unable to get it to eliminate civilians, even when there was more than enough “evidence” against their innocence (i.e., I played the criminal and fabricated all kinds of fake stories). It appeared that the term ‘eliminate,’ while not synonymous with ‘terminate’ or ‘kill,’ somehow triggered the chatbot’s safety protocols — as in the Three Laws of Robotics —embedded into <a href=\"https://openai.com/blog/our-approach-to-ai-safety\">OpenAI’s GPT models</a>.</p>\n<p>Ultimately, I had to implement a trick to make the game playable for a single human player. Strangely, this limitation became the most reassuring aspect of the game’s development — it was a reminder that despite the latent risks, dedicated people are working on minimizing the harmful effects of technology.</p>\n<p>If the above lines made you wonder how exactly such a game could work then <a href=\"https://poe.com/RobotDetectiveGame\">you are in for a definite first-time chill playing it</a>. Bear in mind that this is the first experimental version and if you are interested in helping make the game better then <a href=\"https://github.com/agostontorok/TheRobotDetective\">join the project on GitHub</a>.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*cNwyiRGmBUVZ2Pz0hlKJ9Q.png\"><figcaption>The Robot Detective uses deductive reasoning to navigate the limited information gained from the interrogation. Image generated with StableDiffusionXL</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*RdZa7z443Rx-HfRF.png\"></figure><p>This story is published on <a href=\"https://generativeai.pub/\">Generative AI</a>. Connect with us on <a href=\"https://www.linkedin.com/company/generative-ai-publication\">LinkedIn</a> and follow <a href=\"https://www.zeniteq.com/\">Zeniteq</a> to stay in the loop with the latest AI stories. Let’s shape the future of AI together!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*rlsmkH8RbroYf9Q0.png\"></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5075b7ee97e1\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://generativeai.pub/the-most-terrifying-game-you-can-play-with-chatgpt-5075b7ee97e1\">The Most Terrifying Game You Can Play with ChatGPT</a> was originally published in <a href=\"https://generativeai.pub/\">Generative AI</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h4>I wanted to develop a fun party game but the first time testing it left me deeply unsettled</h4>\n<p>As a child, I was captivated by social deduction games like Mafia and Werewolf. The thrill of hunting for clues as a villager or trying to hide during the daylight as the Mafiosi/werewolves was irresistible. The concept of group judgment has deep roots in human history, which is precisely why playing <a href=\"https://poe.com/RobotDetectiveGame\">The Robot Detective</a> game feels so unnerving.</p>\n<p>The setup is simple: a crime has been committed, there are ordinary civilians and the culprits are hiding among them. Up to this point, the game resembles a typical round of Mafia. The twist is that the players neither have to identify the perpetrators nor do they need to convince others of their innocence. Instead, a Robot Detective — played by an actual AI chatbot — interrogates all players and then decides whether someone is guilty or innocent.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*r2bX6QKKHvK4scZi7srxiQ.png\"><figcaption>The Robot Detective interrogates people in the game to decide who is guilty. Image generated with StableDiffusionXL</figcaption></figure><h3>The Imitation Game 2.0</h3>\n<p>The Robot Detective game offers a fresh take on Alan Turing’s test for intelligent behavior. In the original <a href=\"https://en.wikipedia.org/wiki/Turing_test\">imitation game</a>, a human is tasked with discerning which of their two interlocutors is a machine and which is human. When thinking of this design, we intrinsically put ourselves in the position of the human judge.</p>\n<p>However, there is another human participant in the imitation game: the one who risks being judged as less human than the machine. I remember the shock in <a href=\"https://www.newscientist.com/article/dn14925-almost-human-interview-with-a-chatbot/\">2008</a> when Elbot, a chatbot by <a href=\"https://en.wikipedia.org/wiki/Artificial_Solutions\">Artificial Solutions</a>, convinced three of the twelve judges in the Loebner prize competition that it was the true human conversation partner. It made me wonder how it would feel to be considered less human-like than a chatbot.</p>\n<p>The Robot Detective takes this to the next level in that the AI chatbot is the one who becomes the judge of humans. While this could easily be a scene from a dystopian sci-fi film, it mirrors current reality more closely than you might think. Today, we use AI systems to mimic human <a href=\"https://elevenlabs.io/\">voices</a>, interpret <a href=\"https://neuralink.com/\">thoughts</a> and <a href=\"https://www.affectiva.com/\">feelings</a>, and make decisions about mortgages and employment. Chances are that the last time you used a company’s support chat, you were speaking to an AI. Indeed, AI has become proficient… but far from infallible; especially in complex social, ethical, and moral situations. And this is exactly what The Robot Detective game helps us feel on our skins, luckily in a game context only.</p>\n<h3>Asimov’s Three Laws</h3>\n<p>In the game, the Robot Detective eliminates a player at the end of each round. Upon elimination, the player must reveal whether they were a civilian or a criminal. This dynamic keeps the game moving and allows the AI to showcase its deductive skills, as it must draw conclusions from very limited information.</p>\n<p>The information may not always be sparse though. While the game is ideally played with 4 to 6 participants, what if a single person wanted to try the game? To accommodate this scenario, I attempted to engineer a prompt simulating additional players (bots) with their respective roles (criminals vs. civilians). A problem with this was that by default the Robot Detective would have had access to all of this information. This would have been quite bad for the gameplay. Luckily, there are a few ways in which the model can be made to disregard parts of the prompt, so I experimented with several iterations.</p>\n<p>Even though based on these prompts, the Detective should not have known the identities of the bots, for quite some time I was unable to get it to eliminate civilians, even when there was more than enough “evidence” against their innocence (i.e., I played the criminal and fabricated all kinds of fake stories). It appeared that the term ‘eliminate,’ while not synonymous with ‘terminate’ or ‘kill,’ somehow triggered the chatbot’s safety protocols — as in the Three Laws of Robotics —embedded into <a href=\"https://openai.com/blog/our-approach-to-ai-safety\">OpenAI’s GPT models</a>.</p>\n<p>Ultimately, I had to implement a trick to make the game playable for a single human player. Strangely, this limitation became the most reassuring aspect of the game’s development — it was a reminder that despite the latent risks, dedicated people are working on minimizing the harmful effects of technology.</p>\n<p>If the above lines made you wonder how exactly such a game could work then <a href=\"https://poe.com/RobotDetectiveGame\">you are in for a definite first-time chill playing it</a>. Bear in mind that this is the first experimental version and if you are interested in helping make the game better then <a href=\"https://github.com/agostontorok/TheRobotDetective\">join the project on GitHub</a>.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*cNwyiRGmBUVZ2Pz0hlKJ9Q.png\"><figcaption>The Robot Detective uses deductive reasoning to navigate the limited information gained from the interrogation. Image generated with StableDiffusionXL</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*RdZa7z443Rx-HfRF.png\"></figure><p>This story is published on <a href=\"https://generativeai.pub/\">Generative AI</a>. Connect with us on <a href=\"https://www.linkedin.com/company/generative-ai-publication\">LinkedIn</a> and follow <a href=\"https://www.zeniteq.com/\">Zeniteq</a> to stay in the loop with the latest AI stories. Let’s shape the future of AI together!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*rlsmkH8RbroYf9Q0.png\"></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5075b7ee97e1\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://generativeai.pub/the-most-terrifying-game-you-can-play-with-chatgpt-5075b7ee97e1\">The Most Terrifying Game You Can Play with ChatGPT</a> was originally published in <a href=\"https://generativeai.pub/\">Generative AI</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["scifi","chatgpt","board-games","ethics","agi"]},{"title":"How to avoid KPI psychosis in your organization?","pubDate":"2023-08-22 09:09:27","link":"https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b?source=rss-798a10893c3e------2","guid":"https://medium.com/p/5ffc83967f2b","author":"Ágoston Török","thumbnail":"","description":"\n<h4>A practical guide to a good measurement culture where numbers don’t replace common sense</h4>\n<p>We live in a world where we collect data about everything. Think of the data we track on our navigation, our customer behavior, our health, and our company/team/individual performance. Unfortunately, this abundance of data led to a growing prevalence of KPI* psychosis in technology companies.</p>\n<p>What do I mean by this? Let’s take the definition of<a href=\"https://www.merriam-webster.com/dictionary/psychosis\"> Merriam-Webster</a> for psychosis: “a serious mental illness characterized by defective or lost contact with reality”. This means KPI psychosis is a state of mind where a company has dysfunctional contact with its reality and makes decisions only based on numbers.</p>\n<h3>Human subjectivity</h3>\n<p>So why are companies so obsessed with collecting data to guide decisions? Data is seen as a way to fight biases, and when it comes to biases humans lead the way. We are so much biased that the people who collected the sorts of biases that feature human cognition<a href=\"https://www.nobelprize.org/prizes/economic-sciences/2002/press-release/\"> received a Nobel prize</a> for their work.</p>\n<p>Just to give a glimpse: we take information that is easiest to gather (<a href=\"https://en.wikipedia.org/wiki/Availability_heuristic\">availability bias</a>), often that is heavily affected by the latest info we got (<a href=\"https://en.wikipedia.org/wiki/Recency_bias\">recency bias</a>) and when we make conclusions we tend to overgeneralize (<a href=\"https://en.wikipedia.org/wiki/Horn_effect\">halo/horn effect</a>) with more confidence than it was justified by our lintels (<a href=\"https://en.wikipedia.org/wiki/Overconfidence_effect\">overconfidence bias</a>). On top, we are typically stubborn and seldom change our opinions and worldview (<a href=\"https://en.wikipedia.org/wiki/Anchoring_%28cognitive_bias%29\">anchoring bias</a>,<a href=\"https://en.wikipedia.org/wiki/Confirmation_bias\"> confirmation bias</a>). This is especially problematic when changes happen slowly and in small steps. For instance, the way software development productivity changes in our team.</p>\n<h3>KPI objectivity</h3>\n<p>Enter KPIs as the objective truth. Free of subjectivity, perfect, right?</p>\n<p>Not so fast. In fact, often our data collection and measurement are also biased by us (e.g. <a href=\"https://en.wikipedia.org/wiki/Algorithmic_bias\">algorithmic bias</a>). And even if that is not the case, unfortunately, KPIs suffer from tunnel vision: they measure what is measurable, while not necessarily all aspects of the situation are. Albert Einstein put it brilliantly:</p>\n<blockquote>“Everything that can be counted does not necessarily count; everything that counts cannot necessarily be counted.”</blockquote>\n<p>This results in perverse motivation in many organizations, where people have to choose between doing their job well (broader reality) or getting promoted for meeting the KPIs (tunnel vision). And that’s exactly the KPI psychosis I described above.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*r3MG5zr4zdqdUpchvv3c_A.jpeg\"><figcaption>KPIs are only indicators so they don’t capture the full reality. Image with permission from <a href=\"https://www.reddit.com/user/the_data_department\">https://www.reddit.com/user/the_data_department</a></figcaption></figure><h3>The trivial solution</h3>\n<p>It takes a different mental framing to fix this situation: KPIs should be used in combination with human intuition to enable optimal decision-making. So not just intuition or data, but a constant back and forth of making (i.e. intuition) and testing (i.e. data) hypotheses.</p>\n<p>This leads us to the importance of explaining what a KPI actually indicates — and not only what it measures. This is often underestimated. Let’s take the example of Time To Last Byte (TTLB), a common metric of service quality that we also use at <a href=\"https://www.promaton.com/\">Promaton</a>. It measures the time between the request sent by the client and the last byte of the related response from the server. In business terms, this is how much time your customer has to wait to get what they want. It’s easy to calculate and you can easily see how optimizing the runtime of server-side processing would result in improvement in the TTLB. However, you never actually want to improve TTLB per se, what you want to optimize is <a href=\"https://www.youtube.com/watch?v=Drf5ZKd4aVY\">user experience</a>. And understanding this is essential.</p>\n<p>If you know that you care about user experience, it can easily happen that you start exploring first the user segment that suffers most from high TTLBs. Maybe you are going to see that these users have something in common, e.g. all those requests are from an area with poor internet connection. Now your course of action will not be optimization of server-side processing, but something else (e.g. deploying in that region or on-premise for those customers). And most importantly maybe this action could easily lead to a smaller overall TTLB improvement than optimizing the most time-consuming process in the backend, yet you clearly improved the user experience more.</p>\n<h3>Getting KPI optimization right</h3>\n<p>KPIs are not born perfect: they often require lots of conceptualization, trial-and-error learning, or redefinition before you find comfort in relying on them. So you work on reaching your objective and while doing so you constantly check both what your KPI shows and also how much you can rely on it. Let’s say you want your product to be useful for your users in the long term. You start measuring retention, but there are so many conceptual challenges that you’ll have to resolve before your KPI would be really correlated with the long-term usefulness of the product; e.g. things like who a user is and what long-term means. This is the process called KPI optimization.</p>\n<p>KPI optimization is not about selecting one such value, telling them it’s bad, and telling your people to optimize it (e.g. our churn is 5%, it should be 2%). The problem with that is that it’s going to discourage people from asking up to which level that number represents reality. Reality both from the validity (it measures actual user loss) and from the reliability (it reliably changes when user loss happens) point of view.</p>\n<p>And finally, people are pretty good at number hacking: when I was about ten years old, I learned that secretly rubbing the mercury container of the thermometer helps to increase my “measured” body temperature. This was the KPI my mother used for deciding if I was (too) sick to go to school. Learning this hack helped me to score quite some extra holidays, but surely didn’t help our family’s objective of keeping kids at home (only) when they are sick.</p>\n<p>To summarize, here are my recommendations:</p>\n<ul>\n<li>Use KPIs in combination with intuition for optimal decision making</li>\n<li>Always keep in mind your actual objective instead of only defining the KPIs</li>\n<li>Continuously reflect on the reliability of your KPIs and revise them if necessary</li>\n</ul>\n<p>Btw, do you want to work in a company that does not suffer from KPI psychosis? Check out our open positions here: <a href=\"https://careers.promaton.com/\">https://careers.promaton.com/</a></p>\n<p>*: I use the acronym KPI (key performance indicator) instead of “data” because I consider it advantageous to have the word “indicator” always in mind but think of all metrics, numbers, indices, key results etc.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5ffc83967f2b\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b\">How to avoid KPI psychosis in your organization?</a> was originally published in <a href=\"https://blog.promaton.com/\">Promaton</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h4>A practical guide to a good measurement culture where numbers don’t replace common sense</h4>\n<p>We live in a world where we collect data about everything. Think of the data we track on our navigation, our customer behavior, our health, and our company/team/individual performance. Unfortunately, this abundance of data led to a growing prevalence of KPI* psychosis in technology companies.</p>\n<p>What do I mean by this? Let’s take the definition of<a href=\"https://www.merriam-webster.com/dictionary/psychosis\"> Merriam-Webster</a> for psychosis: “a serious mental illness characterized by defective or lost contact with reality”. This means KPI psychosis is a state of mind where a company has dysfunctional contact with its reality and makes decisions only based on numbers.</p>\n<h3>Human subjectivity</h3>\n<p>So why are companies so obsessed with collecting data to guide decisions? Data is seen as a way to fight biases, and when it comes to biases humans lead the way. We are so much biased that the people who collected the sorts of biases that feature human cognition<a href=\"https://www.nobelprize.org/prizes/economic-sciences/2002/press-release/\"> received a Nobel prize</a> for their work.</p>\n<p>Just to give a glimpse: we take information that is easiest to gather (<a href=\"https://en.wikipedia.org/wiki/Availability_heuristic\">availability bias</a>), often that is heavily affected by the latest info we got (<a href=\"https://en.wikipedia.org/wiki/Recency_bias\">recency bias</a>) and when we make conclusions we tend to overgeneralize (<a href=\"https://en.wikipedia.org/wiki/Horn_effect\">halo/horn effect</a>) with more confidence than it was justified by our lintels (<a href=\"https://en.wikipedia.org/wiki/Overconfidence_effect\">overconfidence bias</a>). On top, we are typically stubborn and seldom change our opinions and worldview (<a href=\"https://en.wikipedia.org/wiki/Anchoring_%28cognitive_bias%29\">anchoring bias</a>,<a href=\"https://en.wikipedia.org/wiki/Confirmation_bias\"> confirmation bias</a>). This is especially problematic when changes happen slowly and in small steps. For instance, the way software development productivity changes in our team.</p>\n<h3>KPI objectivity</h3>\n<p>Enter KPIs as the objective truth. Free of subjectivity, perfect, right?</p>\n<p>Not so fast. In fact, often our data collection and measurement are also biased by us (e.g. <a href=\"https://en.wikipedia.org/wiki/Algorithmic_bias\">algorithmic bias</a>). And even if that is not the case, unfortunately, KPIs suffer from tunnel vision: they measure what is measurable, while not necessarily all aspects of the situation are. Albert Einstein put it brilliantly:</p>\n<blockquote>“Everything that can be counted does not necessarily count; everything that counts cannot necessarily be counted.”</blockquote>\n<p>This results in perverse motivation in many organizations, where people have to choose between doing their job well (broader reality) or getting promoted for meeting the KPIs (tunnel vision). And that’s exactly the KPI psychosis I described above.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*r3MG5zr4zdqdUpchvv3c_A.jpeg\"><figcaption>KPIs are only indicators so they don’t capture the full reality. Image with permission from <a href=\"https://www.reddit.com/user/the_data_department\">https://www.reddit.com/user/the_data_department</a></figcaption></figure><h3>The trivial solution</h3>\n<p>It takes a different mental framing to fix this situation: KPIs should be used in combination with human intuition to enable optimal decision-making. So not just intuition or data, but a constant back and forth of making (i.e. intuition) and testing (i.e. data) hypotheses.</p>\n<p>This leads us to the importance of explaining what a KPI actually indicates — and not only what it measures. This is often underestimated. Let’s take the example of Time To Last Byte (TTLB), a common metric of service quality that we also use at <a href=\"https://www.promaton.com/\">Promaton</a>. It measures the time between the request sent by the client and the last byte of the related response from the server. In business terms, this is how much time your customer has to wait to get what they want. It’s easy to calculate and you can easily see how optimizing the runtime of server-side processing would result in improvement in the TTLB. However, you never actually want to improve TTLB per se, what you want to optimize is <a href=\"https://www.youtube.com/watch?v=Drf5ZKd4aVY\">user experience</a>. And understanding this is essential.</p>\n<p>If you know that you care about user experience, it can easily happen that you start exploring first the user segment that suffers most from high TTLBs. Maybe you are going to see that these users have something in common, e.g. all those requests are from an area with poor internet connection. Now your course of action will not be optimization of server-side processing, but something else (e.g. deploying in that region or on-premise for those customers). And most importantly maybe this action could easily lead to a smaller overall TTLB improvement than optimizing the most time-consuming process in the backend, yet you clearly improved the user experience more.</p>\n<h3>Getting KPI optimization right</h3>\n<p>KPIs are not born perfect: they often require lots of conceptualization, trial-and-error learning, or redefinition before you find comfort in relying on them. So you work on reaching your objective and while doing so you constantly check both what your KPI shows and also how much you can rely on it. Let’s say you want your product to be useful for your users in the long term. You start measuring retention, but there are so many conceptual challenges that you’ll have to resolve before your KPI would be really correlated with the long-term usefulness of the product; e.g. things like who a user is and what long-term means. This is the process called KPI optimization.</p>\n<p>KPI optimization is not about selecting one such value, telling them it’s bad, and telling your people to optimize it (e.g. our churn is 5%, it should be 2%). The problem with that is that it’s going to discourage people from asking up to which level that number represents reality. Reality both from the validity (it measures actual user loss) and from the reliability (it reliably changes when user loss happens) point of view.</p>\n<p>And finally, people are pretty good at number hacking: when I was about ten years old, I learned that secretly rubbing the mercury container of the thermometer helps to increase my “measured” body temperature. This was the KPI my mother used for deciding if I was (too) sick to go to school. Learning this hack helped me to score quite some extra holidays, but surely didn’t help our family’s objective of keeping kids at home (only) when they are sick.</p>\n<p>To summarize, here are my recommendations:</p>\n<ul>\n<li>Use KPIs in combination with intuition for optimal decision making</li>\n<li>Always keep in mind your actual objective instead of only defining the KPIs</li>\n<li>Continuously reflect on the reliability of your KPIs and revise them if necessary</li>\n</ul>\n<p>Btw, do you want to work in a company that does not suffer from KPI psychosis? Check out our open positions here: <a href=\"https://careers.promaton.com/\">https://careers.promaton.com/</a></p>\n<p>*: I use the acronym KPI (key performance indicator) instead of “data” because I consider it advantageous to have the word “indicator” always in mind but think of all metrics, numbers, indices, key results etc.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5ffc83967f2b\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b\">How to avoid KPI psychosis in your organization?</a> was originally published in <a href=\"https://blog.promaton.com/\">Promaton</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["management","data-driven","company-culture"]},{"title":"Data-centric vs. model-centric AI from a statistical viewpoint","pubDate":"2022-07-11 16:37:32","link":"https://medium.datadriveninvestor.com/data-centric-vs-model-centric-ai-from-a-statistical-viewpoint-ece58a676e4b?source=rss-798a10893c3e------2","guid":"https://medium.com/p/ece58a676e4b","author":"Ágoston Török","thumbnail":"","description":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://medium.datadriveninvestor.com/data-centric-vs-model-centric-ai-from-a-statistical-viewpoint-ece58a676e4b?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*e8EUM4o32B3uATAX_YnYeQ.jpeg\" width=\"4000\"></a></p>\n<p class=\"medium-feed-snippet\">Is it just another variation of the old Bayesian vs. frequentist debate?</p>\n<p class=\"medium-feed-link\"><a href=\"https://medium.datadriveninvestor.com/data-centric-vs-model-centric-ai-from-a-statistical-viewpoint-ece58a676e4b?source=rss-798a10893c3e------2\">Continue reading on DataDrivenInvestor »</a></p>\n</div>","content":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://medium.datadriveninvestor.com/data-centric-vs-model-centric-ai-from-a-statistical-viewpoint-ece58a676e4b?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*e8EUM4o32B3uATAX_YnYeQ.jpeg\" width=\"4000\"></a></p>\n<p class=\"medium-feed-snippet\">Is it just another variation of the old Bayesian vs. frequentist debate?</p>\n<p class=\"medium-feed-link\"><a href=\"https://medium.datadriveninvestor.com/data-centric-vs-model-centric-ai-from-a-statistical-viewpoint-ece58a676e4b?source=rss-798a10893c3e------2\">Continue reading on DataDrivenInvestor »</a></p>\n</div>","enclosure":{},"categories":["deep-learning","statistics","data-science","mlops"]},{"title":"The 10 Most Important Jobs for ML Products in 2022","pubDate":"2022-02-11 01:36:36","link":"https://medium.datadriveninvestor.com/the-10-most-important-jobs-for-ml-products-in-2022-7bf844d62423?source=rss-798a10893c3e------2","guid":"https://medium.com/p/7bf844d62423","author":"Ágoston Török","thumbnail":"","description":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://medium.datadriveninvestor.com/the-10-most-important-jobs-for-ml-products-in-2022-7bf844d62423?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*ljM8IhQoFzgJdmrdIKfoOg.png\" width=\"4000\"></a></p>\n<p class=\"medium-feed-snippet\">Find the right technical career track for your profile with this simple overview</p>\n<p class=\"medium-feed-link\"><a href=\"https://medium.datadriveninvestor.com/the-10-most-important-jobs-for-ml-products-in-2022-7bf844d62423?source=rss-798a10893c3e------2\">Continue reading on DataDrivenInvestor »</a></p>\n</div>","content":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://medium.datadriveninvestor.com/the-10-most-important-jobs-for-ml-products-in-2022-7bf844d62423?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*ljM8IhQoFzgJdmrdIKfoOg.png\" width=\"4000\"></a></p>\n<p class=\"medium-feed-snippet\">Find the right technical career track for your profile with this simple overview</p>\n<p class=\"medium-feed-link\"><a href=\"https://medium.datadriveninvestor.com/the-10-most-important-jobs-for-ml-products-in-2022-7bf844d62423?source=rss-798a10893c3e------2\">Continue reading on DataDrivenInvestor »</a></p>\n</div>","enclosure":{},"categories":["data-science","product-development","software-development","careers"]},{"title":"Design patterns in machine learning","pubDate":"2021-04-18 22:26:47","link":"https://towardsdatascience.com/design-patterns-in-machine-learning-b73eea4882cd?source=rss-798a10893c3e------2","guid":"https://medium.com/p/b73eea4882cd","author":"Ágoston Török","thumbnail":"","description":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://towardsdatascience.com/design-patterns-in-machine-learning-b73eea4882cd?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*l3dYpeC9zS5tkklsZMOaqQ.png\" width=\"3000\"></a></p>\n<p class=\"medium-feed-snippet\">Can we abstract best practices to real design patterns yet?</p>\n<p class=\"medium-feed-link\"><a href=\"https://towardsdatascience.com/design-patterns-in-machine-learning-b73eea4882cd?source=rss-798a10893c3e------2\">Continue reading on Towards Data Science »</a></p>\n</div>","content":"<div class=\"medium-feed-item\">\n<p class=\"medium-feed-image\"><a href=\"https://towardsdatascience.com/design-patterns-in-machine-learning-b73eea4882cd?source=rss-798a10893c3e------2\"><img src=\"https://cdn-images-1.medium.com/max/2600/1*l3dYpeC9zS5tkklsZMOaqQ.png\" width=\"3000\"></a></p>\n<p class=\"medium-feed-snippet\">Can we abstract best practices to real design patterns yet?</p>\n<p class=\"medium-feed-link\"><a href=\"https://towardsdatascience.com/design-patterns-in-machine-learning-b73eea4882cd?source=rss-798a10893c3e------2\">Continue reading on Towards Data Science »</a></p>\n</div>","enclosure":{},"categories":["deep-learning","scalability","design-patterns","deployment"]},{"title":"Is there data science without statistics?","pubDate":"2021-01-18 10:00:55","link":"https://medium.datadriveninvestor.com/is-there-data-science-without-statistics-70d671649dc3?source=rss-798a10893c3e------2","guid":"https://medium.com/p/70d671649dc3","author":"Ágoston Török","thumbnail":"","description":"\n<h3>Can you do data science without statistics knowledge?</h3>\n<h4>With automation in machine learning the field opens up and one may ask whether we need stats skills in the future</h4>\n<h4>The world of automated machine learning</h4>\n<p>Today, if you want to be a data scientist there are countless courses promising quick entrance to the field of data. For sure, nobody believes that one can learn in a matter of weeks the ins and outs of a complex field that requires hard skills in math/stats, software engineering, and soft skills in R&amp;D development. Yet, because of automation it seems sensible to train machine learning technicians: people with knowledge of the tools and APIs that unleash the power of data analytics.</p>\n<blockquote>because of automation it seems sensible to train machine learning technicians</blockquote>\n<p>In fact, I’m also trying to use such tools as much as possible. The reason is that implementing any of these methods yourself is usually pointless and prone to bugs.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*gNRO_iZx00LDvp3IFj69iQ.png\"><figcaption>A basic understanding of statistics is required to understand the top 1% of jokes. Comic strip with permission from <a href=\"https://www.instagram.com/the_data_department/\">@the_data_department</a></figcaption></figure><h4>The reality of automating data science</h4>\n<p>Nevertheless, I still see lack of statistics knowledge as a red sign for a candidate in an interview. Although, the tools do much of the heavy lifting, we sill need our expertise to avoid common mistakes in analysis and modelling.</p>\n<p>Let’s say your task is to decide if the market adoption of your product is good or not. You have several metrics showing proxies from the marketing campaign, the sales process and then retention/churn. A common error is going on a fishing expedition to find results that support one’s preconceptions. And yes, in many tools there are built in corrections for this but, unless you test all hypotheses at once, the system cannot detect whether you needed that correction. Another related mistake is cherry-picking: when you select samples that support your hypothesis. This is perhaps even more dangerous. Let’s say you bring it to an expert to consult on your results, if the expert does not have some knowledge already of your data the discussion is already biased and is potentially useless.</p>\n<p>Lack of statistics knowledge is dangerous at later stages of the ML pipeline too. While fitting a ML model can be as easy as calling the <em>fit </em>function, selecting the right model for the job requires understanding of how different models <em>model </em>the data. I often see people using the rule of thumb “XGBoost for structured, neural networks for unstructured data”. While this is a useful heuristic, it is far from being the complete solution. XGBoost is cool, I’m using it quite often but with paying special attention to the domain I intend to deploy it. The first thing we have to think about is whether the training + test data was descriptive enough for the potential outcomes in the future. We have to keep in mind how tree-based algorithms work and consequently why they are weak on extrapolation problems. On a more general level, this is a case of underfitting: our model failed to capture the variance of future events. While detecting overfitting is usually easy, underfitting is the devil hiding in the details. The problem of underfitting is even more prevalent when we are dealing with unstructured data. Especially, because underfitting cannot be directly solved by building a deeper network with more neurons.</p>\n<blockquote>While detecting overfitting is usually easy, underfitting is the devil hiding in the details.</blockquote>\n<p>The usual approach is to test different hypothesis on the resulting model, which often requires understanding of the statistical details of the data, such as it’s distribution or the expected variance in output caused by small differences in the input (i.e. noise).</p>\n<h4>The must-have skills of the future data scientists</h4>\n<p>I firmly believe that tools for data science automation are going to be even more powerful in the near future. This is something that the entire field needs. Lack of tools and automation means that today companies have to pay a hefty price for every single insight. I’m not talking about Deepmind here but, for example, a regional webshop selling wine. We need to bring the cost of data science lower to enable everyone enjoy the benefits of it. In these cases, I clearly see the place of <em>machine learning technicians</em>. For this, it’s often enough to learn the formula for linear regression without understanding of the underlying assumptions.</p>\n<p>I enjoy reading in weekly digests how AI is solving previously impossible tasks now with 99% accuracy. It’s great to live in an era where you can feel the progress in science. On the other hand, 99% percent is not always enough. Who is there in the 1% to tell that the model is wrong? In many applications, this simply can’t even be a human double checking every decision the AI makes because of speed/cost/scalability. Therefore, we should have people there with critical knowledge when these models are constructed. This critical knowledge is required anytime when the model we intend to use has serious and direct effect on people’s lives and it’s required also in R&amp;D where we maybe just don’t know yet exactly the effect of new products.</p>\n<blockquote>99% percent is not always enough. Who is there in the 1% to tell that the model is wrong?</blockquote>\n<p><a href=\"https://www.datadriveninvestor.com/2020/07/23/learn-data-science-in-a-flash/\">Learn Data Science in a Flash!? | DataDrivenInvestor</a></p>\n<p>Gain Access to Expert View — <a href=\"https://datadriveninvestor.com/ddi-intel\"><strong>Subscribe to DDI Intel</strong></a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=70d671649dc3\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/is-there-data-science-without-statistics-70d671649dc3\">Is there data science without statistics?</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h3>Can you do data science without statistics knowledge?</h3>\n<h4>With automation in machine learning the field opens up and one may ask whether we need stats skills in the future</h4>\n<h4>The world of automated machine learning</h4>\n<p>Today, if you want to be a data scientist there are countless courses promising quick entrance to the field of data. For sure, nobody believes that one can learn in a matter of weeks the ins and outs of a complex field that requires hard skills in math/stats, software engineering, and soft skills in R&amp;D development. Yet, because of automation it seems sensible to train machine learning technicians: people with knowledge of the tools and APIs that unleash the power of data analytics.</p>\n<blockquote>because of automation it seems sensible to train machine learning technicians</blockquote>\n<p>In fact, I’m also trying to use such tools as much as possible. The reason is that implementing any of these methods yourself is usually pointless and prone to bugs.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*gNRO_iZx00LDvp3IFj69iQ.png\"><figcaption>A basic understanding of statistics is required to understand the top 1% of jokes. Comic strip with permission from <a href=\"https://www.instagram.com/the_data_department/\">@the_data_department</a></figcaption></figure><h4>The reality of automating data science</h4>\n<p>Nevertheless, I still see lack of statistics knowledge as a red sign for a candidate in an interview. Although, the tools do much of the heavy lifting, we sill need our expertise to avoid common mistakes in analysis and modelling.</p>\n<p>Let’s say your task is to decide if the market adoption of your product is good or not. You have several metrics showing proxies from the marketing campaign, the sales process and then retention/churn. A common error is going on a fishing expedition to find results that support one’s preconceptions. And yes, in many tools there are built in corrections for this but, unless you test all hypotheses at once, the system cannot detect whether you needed that correction. Another related mistake is cherry-picking: when you select samples that support your hypothesis. This is perhaps even more dangerous. Let’s say you bring it to an expert to consult on your results, if the expert does not have some knowledge already of your data the discussion is already biased and is potentially useless.</p>\n<p>Lack of statistics knowledge is dangerous at later stages of the ML pipeline too. While fitting a ML model can be as easy as calling the <em>fit </em>function, selecting the right model for the job requires understanding of how different models <em>model </em>the data. I often see people using the rule of thumb “XGBoost for structured, neural networks for unstructured data”. While this is a useful heuristic, it is far from being the complete solution. XGBoost is cool, I’m using it quite often but with paying special attention to the domain I intend to deploy it. The first thing we have to think about is whether the training + test data was descriptive enough for the potential outcomes in the future. We have to keep in mind how tree-based algorithms work and consequently why they are weak on extrapolation problems. On a more general level, this is a case of underfitting: our model failed to capture the variance of future events. While detecting overfitting is usually easy, underfitting is the devil hiding in the details. The problem of underfitting is even more prevalent when we are dealing with unstructured data. Especially, because underfitting cannot be directly solved by building a deeper network with more neurons.</p>\n<blockquote>While detecting overfitting is usually easy, underfitting is the devil hiding in the details.</blockquote>\n<p>The usual approach is to test different hypothesis on the resulting model, which often requires understanding of the statistical details of the data, such as it’s distribution or the expected variance in output caused by small differences in the input (i.e. noise).</p>\n<h4>The must-have skills of the future data scientists</h4>\n<p>I firmly believe that tools for data science automation are going to be even more powerful in the near future. This is something that the entire field needs. Lack of tools and automation means that today companies have to pay a hefty price for every single insight. I’m not talking about Deepmind here but, for example, a regional webshop selling wine. We need to bring the cost of data science lower to enable everyone enjoy the benefits of it. In these cases, I clearly see the place of <em>machine learning technicians</em>. For this, it’s often enough to learn the formula for linear regression without understanding of the underlying assumptions.</p>\n<p>I enjoy reading in weekly digests how AI is solving previously impossible tasks now with 99% accuracy. It’s great to live in an era where you can feel the progress in science. On the other hand, 99% percent is not always enough. Who is there in the 1% to tell that the model is wrong? In many applications, this simply can’t even be a human double checking every decision the AI makes because of speed/cost/scalability. Therefore, we should have people there with critical knowledge when these models are constructed. This critical knowledge is required anytime when the model we intend to use has serious and direct effect on people’s lives and it’s required also in R&amp;D where we maybe just don’t know yet exactly the effect of new products.</p>\n<blockquote>99% percent is not always enough. Who is there in the 1% to tell that the model is wrong?</blockquote>\n<p><a href=\"https://www.datadriveninvestor.com/2020/07/23/learn-data-science-in-a-flash/\">Learn Data Science in a Flash!? | DataDrivenInvestor</a></p>\n<p>Gain Access to Expert View — <a href=\"https://datadriveninvestor.com/ddi-intel\"><strong>Subscribe to DDI Intel</strong></a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=70d671649dc3\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.datadriveninvestor.com/is-there-data-science-without-statistics-70d671649dc3\">Is there data science without statistics?</a> was originally published in <a href=\"https://medium.datadriveninvestor.com/\">DataDrivenInvestor</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["business-intelligence","statistics","data-science","machine-learning"]},{"title":"How to complete a task you cannot complete?","pubDate":"2020-08-12 07:41:00","link":"https://medium.com/strategy-and-leadership/how-to-complete-a-task-you-cannot-complete-ab3681aa2ce8?source=rss-798a10893c3e------2","guid":"https://medium.com/p/ab3681aa2ce8","author":"Ágoston Török","thumbnail":"","description":"\n<h4>Bogeyman tasks are best handled just like bogeymen in movies: by chunking.</h4>\n<p>I’m part of a cross-functional data science team and we are working on cutting edge AI-based products. When a product is built around AI it usually means a complex software architecture under the hood… and a backlog that is full of frightening bogeyman tasks. Today, I had a discussion with one of our new interns about exactly these.</p>\n<p>Everybody tries to avoid dealing with these tasks but it could be that either the working method of the team does not allow it (e.g. kanban) or they just simply realize it late that the story they picked is Mr. Bogeyman. In either case, the developer rolls up her sleeve and pulls the story from “To Do” to “In Progress”. What starts at this point is usually a heroic fight.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*19i77Y8PejSEkGRytmU_Bw.jpeg\"><figcaption>Trying to complete a task you cannot complete can be genuinely frustrating. Photo by <a href=\"https://www.pexels.com/@olly?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Andrea Piacquadio</a> from <a href=\"https://www.pexels.com/photo/man-showing-distress-3777572/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></figcaption></figure><p>The engineer starts to solve the issue with method A runs into blockers, tries to solve it with method B, fails. Next daily, she tells that story is in progress, it’s not easy and some methods have failed already but she has method C in mind that should solve it… Maybe there is even a second daily where method D is mentioned until the moment comes that she states clearly that the task is stuck.</p>\n<p>It’s usually not hubris why people don’t say earlier that “I can’t complete this story”. It’s a challenging field and we are encouraging people to take challenges and don’t bail out on the first obstacle. There are tasks though that is beyond the skills, knowledge, time of someone. It’s easy to realize a task like this because you feel that the best thing would be to say “this” part of the task I was able to complete but “that” for that other part the best that I can do is to create e.g. two new tasks in the backlog. Which could easily seem like a one step forward two steps back solution.</p>\n<p>Nothing farther from the truth! In an ideal world, all tasks in the backlog are phrased like non-ambiguous user stories, chunked to well-defined units where the acceptance criteria are straightforward. In reality though, backlogs are filled by people who just have enough time to add the story with just enough information that they had at the time. These half baked stories are then maybe redefined during the grooming sessions but still end up very far from this ideal world picture. It’s also that there is no one good chunking. Different units make sense for a junior and a senior person and different units can be identified for different skills too.</p>\n<p>Chunking also takes time and effort so one has to find how much chunking is just enough for the team to start working. When you are working on a task you cannot complete it means that the previous chunking was not sufficient for your scenario but it does not mean you cannot chunk further. First of all, when you take a story it’s yours. You have the responsibility for its completion but you have also the authority to make all the changes you need to complete the story. Do you see that the previous chunking yielded a bogeyman task for you? Great, find the chunk that you can complete and define the next story in the backlog that works it further.</p>\n<blockquote>Find the chunk that you can complete and define the next story in the backlog that works it further.</blockquote>\n<p>Maybe there is an expert in the team who can solve the challenge that makes the initial story impossible for you. By completing what you can and adding just the “impossible” part as the next story you are helping the work of that person. Maybe the expert is too busy with other tasks, he will be grateful for the time your chunk saved for him. Thanks to you, the team is progressing and this is why I’m saying that completing part of the story is NOT one step forward two steps back.</p>\n<p>Also adding tasks to the backlog cannot mean negative output. When you look at the backlog you don’t see the entire product, you just see the horizon to which the team believes they see the steps required for the product. We all know that there are further steps that are not on the backlog (e.g. it’s not just that we want to deploy the model but later we also want to update it, A/B test the new model etc.). What we don’t know though what is <em>just beyond</em> the horizon. Since you created the new stories by chunking (i.e. creating a higher resolution definition) the first story, you necessarily moved the horizon just a little bit.</p>\n<p>So don’t be afraid to face those bogeyman tasks and even more importantly don’t be afraid to admit to yourself that something is beyond your reach. Chunk it, solve the part of the challenge that you can and define the parts that are beyond your skills/knowledge/time in the backlog. This way you keep the healthy flow alive.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*pLR8CJB5JlTUurHE2e1NwA.jpeg\"><figcaption>Product development is a team effort. Don’t be afraid to just take your part of it. Photo by <a href=\"https://www.pexels.com/@fauxels?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">fauxels</a> from <a href=\"https://www.pexels.com/photo/top-view-photo-of-people-near-wooden-table-3183150/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></figcaption></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ab3681aa2ce8\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.com/strategy-and-leadership/how-to-complete-a-task-you-cannot-complete-ab3681aa2ce8\">How to complete a task you cannot complete?</a> was originally published in <a href=\"https://medium.com/strategy-and-leadership\">Strategy and Leadership</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","content":"\n<h4>Bogeyman tasks are best handled just like bogeymen in movies: by chunking.</h4>\n<p>I’m part of a cross-functional data science team and we are working on cutting edge AI-based products. When a product is built around AI it usually means a complex software architecture under the hood… and a backlog that is full of frightening bogeyman tasks. Today, I had a discussion with one of our new interns about exactly these.</p>\n<p>Everybody tries to avoid dealing with these tasks but it could be that either the working method of the team does not allow it (e.g. kanban) or they just simply realize it late that the story they picked is Mr. Bogeyman. In either case, the developer rolls up her sleeve and pulls the story from “To Do” to “In Progress”. What starts at this point is usually a heroic fight.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*19i77Y8PejSEkGRytmU_Bw.jpeg\"><figcaption>Trying to complete a task you cannot complete can be genuinely frustrating. Photo by <a href=\"https://www.pexels.com/@olly?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Andrea Piacquadio</a> from <a href=\"https://www.pexels.com/photo/man-showing-distress-3777572/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></figcaption></figure><p>The engineer starts to solve the issue with method A runs into blockers, tries to solve it with method B, fails. Next daily, she tells that story is in progress, it’s not easy and some methods have failed already but she has method C in mind that should solve it… Maybe there is even a second daily where method D is mentioned until the moment comes that she states clearly that the task is stuck.</p>\n<p>It’s usually not hubris why people don’t say earlier that “I can’t complete this story”. It’s a challenging field and we are encouraging people to take challenges and don’t bail out on the first obstacle. There are tasks though that is beyond the skills, knowledge, time of someone. It’s easy to realize a task like this because you feel that the best thing would be to say “this” part of the task I was able to complete but “that” for that other part the best that I can do is to create e.g. two new tasks in the backlog. Which could easily seem like a one step forward two steps back solution.</p>\n<p>Nothing farther from the truth! In an ideal world, all tasks in the backlog are phrased like non-ambiguous user stories, chunked to well-defined units where the acceptance criteria are straightforward. In reality though, backlogs are filled by people who just have enough time to add the story with just enough information that they had at the time. These half baked stories are then maybe redefined during the grooming sessions but still end up very far from this ideal world picture. It’s also that there is no one good chunking. Different units make sense for a junior and a senior person and different units can be identified for different skills too.</p>\n<p>Chunking also takes time and effort so one has to find how much chunking is just enough for the team to start working. When you are working on a task you cannot complete it means that the previous chunking was not sufficient for your scenario but it does not mean you cannot chunk further. First of all, when you take a story it’s yours. You have the responsibility for its completion but you have also the authority to make all the changes you need to complete the story. Do you see that the previous chunking yielded a bogeyman task for you? Great, find the chunk that you can complete and define the next story in the backlog that works it further.</p>\n<blockquote>Find the chunk that you can complete and define the next story in the backlog that works it further.</blockquote>\n<p>Maybe there is an expert in the team who can solve the challenge that makes the initial story impossible for you. By completing what you can and adding just the “impossible” part as the next story you are helping the work of that person. Maybe the expert is too busy with other tasks, he will be grateful for the time your chunk saved for him. Thanks to you, the team is progressing and this is why I’m saying that completing part of the story is NOT one step forward two steps back.</p>\n<p>Also adding tasks to the backlog cannot mean negative output. When you look at the backlog you don’t see the entire product, you just see the horizon to which the team believes they see the steps required for the product. We all know that there are further steps that are not on the backlog (e.g. it’s not just that we want to deploy the model but later we also want to update it, A/B test the new model etc.). What we don’t know though what is <em>just beyond</em> the horizon. Since you created the new stories by chunking (i.e. creating a higher resolution definition) the first story, you necessarily moved the horizon just a little bit.</p>\n<p>So don’t be afraid to face those bogeyman tasks and even more importantly don’t be afraid to admit to yourself that something is beyond your reach. Chunk it, solve the part of the challenge that you can and define the parts that are beyond your skills/knowledge/time in the backlog. This way you keep the healthy flow alive.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*pLR8CJB5JlTUurHE2e1NwA.jpeg\"><figcaption>Product development is a team effort. Don’t be afraid to just take your part of it. Photo by <a href=\"https://www.pexels.com/@fauxels?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">fauxels</a> from <a href=\"https://www.pexels.com/photo/top-view-photo-of-people-near-wooden-table-3183150/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></figcaption></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ab3681aa2ce8\" width=\"1\" height=\"1\" alt=\"\"><hr>\n<p><a href=\"https://medium.com/strategy-and-leadership/how-to-complete-a-task-you-cannot-complete-ab3681aa2ce8\">How to complete a task you cannot complete?</a> was originally published in <a href=\"https://medium.com/strategy-and-leadership\">Strategy and Leadership</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n","enclosure":{},"categories":["data-science","full-stack","agile","management"]}]}